SoCXin/HC32F4A0/src/hc32f4a0pitb_template/common/hc32f4a0pitb.h
/**
 * @brief USBHS
 */
typedef struct
{
    __IO uint32_t GVBUSCFG;
    uint8_t RESERVED0[4];
    __IO uint32_t GAHBCFG;
    __IO uint32_t GUSBCFG;
    __IO uint32_t GRSTCTL;
    __IO uint32_t GINTSTS;
    __IO uint32_t GINTMSK;
    __IO uint32_t GRXSTSR;
    __IO uint32_t GRXSTSP;
    __IO uint32_t GRXFSIZ;
    __IO uint32_t HNPTXFSIZ;
    __IO uint32_t HNPTXSTS;
    uint8_t RESERVED1[12];
    __IO uint32_t CID;
    uint8_t RESERVED2[20];
    __IO uint32_t GLPMCFG;
    uint8_t RESERVED3[168];
    __IO uint32_t HPTXFSIZ;
    __IO uint32_t DIEPTXF1;
    __IO uint32_t DIEPTXF2;
    __IO uint32_t DIEPTXF3;
    __IO uint32_t DIEPTXF4;
    __IO uint32_t DIEPTXF5;
    __IO uint32_t DIEPTXF6;
    __IO uint32_t DIEPTXF7;
    __IO uint32_t DIEPTXF8;
    __IO uint32_t DIEPTXF9;
    __IO uint32_t DIEPTXF10;
    __IO uint32_t DIEPTXF11;
    __IO uint32_t DIEPTXF12;
    __IO uint32_t DIEPTXF13;
    __IO uint32_t DIEPTXF14;
    __IO uint32_t DIEPTXF15;
    uint8_t RESERVED4[704];
    __IO uint32_t HCFG;
    __IO uint32_t HFIR;
    __IO uint32_t HFNUM;
    uint8_t RESERVED5[4];
    __IO uint32_t HPTXSTS;
    __IO uint32_t HAINT;
    __IO uint32_t HAINTMSK;
    uint8_t RESERVED6[36];
    __IO uint32_t HPRT;
    uint8_t RESERVED7[188];
    __IO uint32_t HCCHAR0;
    __IO uint32_t HCSPLT0;
    __IO uint32_t HCINT0;
    __IO uint32_t HCINTMSK0;
    __IO uint32_t HCTSIZ0;
    __IO uint32_t HCDMA0;
    uint8_t RESERVED8[8];
    __IO uint32_t HCCHAR1;
    __IO uint32_t HCSPLT1;
    __IO uint32_t HCINT1;
    __IO uint32_t HCINTMSK1;
    __IO uint32_t HCTSIZ1;
    __IO uint32_t HCDMA1;
    uint8_t RESERVED9[8];
    __IO uint32_t HCCHAR2;
    __IO uint32_t HCSPLT2;
    __IO uint32_t HCINT2;
    __IO uint32_t HCINTMSK2;
    __IO uint32_t HCTSIZ2;
    __IO uint32_t HCDMA2;
    uint8_t RESERVED10[8];
    __IO uint32_t HCCHAR3;
    __IO uint32_t HCSPLT3;
    __IO uint32_t HCINT3;
    __IO uint32_t HCINTMSK3;
    __IO uint32_t HCTSIZ3;
    __IO uint32_t HCDMA3;
    uint8_t RESERVED11[8];
    __IO uint32_t HCCHAR4;
    __IO uint32_t HCSPLT4;
    __IO uint32_t HCINT4;
    __IO uint32_t HCINTMSK4;
    __IO uint32_t HCTSIZ4;
    __IO uint32_t HCDMA4;
    uint8_t RESERVED12[8];
    __IO uint32_t HCCHAR5;
    __IO uint32_t HCSPLT5;
    __IO uint32_t HCINT5;
    __IO uint32_t HCINTMSK5;
    __IO uint32_t HCTSIZ5;
    __IO uint32_t HCDMA5;
    uint8_t RESERVED13[8];
    __IO uint32_t HCCHAR6;
    __IO uint32_t HCSPLT6;
    __IO uint32_t HCINT6;
    __IO uint32_t HCINTMSK6;
    __IO uint32_t HCTSIZ6;
    __IO uint32_t HCDMA6;
    uint8_t RESERVED14[8];
    __IO uint32_t HCCHAR7;
    __IO uint32_t HCSPLT7;
    __IO uint32_t HCINT7;
    __IO uint32_t HCINTMSK7;
    __IO uint32_t HCTSIZ7;
    __IO uint32_t HCDMA7;
    uint8_t RESERVED15[8];
    __IO uint32_t HCCHAR8;
    __IO uint32_t HCSPLT8;
    __IO uint32_t HCINT8;
    __IO uint32_t HCINTMSK8;
    __IO uint32_t HCTSIZ8;
    __IO uint32_t HCDMA8;
    uint8_t RESERVED16[8];
    __IO uint32_t HCCHAR9;
    __IO uint32_t HCSPLT9;
    __IO uint32_t HCINT9;
    __IO uint32_t HCINTMSK9;
    __IO uint32_t HCTSIZ9;
    __IO uint32_t HCDMA9;
    uint8_t RESERVED17[8];
    __IO uint32_t HCCHAR10;
    __IO uint32_t HCSPLT10;
    __IO uint32_t HCINT10;
    __IO uint32_t HCINTMSK10;
    __IO uint32_t HCTSIZ10;
    __IO uint32_t HCDMA10;
    uint8_t RESERVED18[8];
    __IO uint32_t HCCHAR11;
    __IO uint32_t HCSPLT11;
    __IO uint32_t HCINT11;
    __IO uint32_t HCINTMSK11;
    __IO uint32_t HCTSIZ11;
    __IO uint32_t HCDMA11;
    uint8_t RESERVED19[8];
    __IO uint32_t HCCHAR12;
    __IO uint32_t HCSPLT12;
    __IO uint32_t HCINT12;
    __IO uint32_t HCINTMSK12;
    __IO uint32_t HCTSIZ12;
    __IO uint32_t HCDMA12;
    uint8_t RESERVED20[8];
    __IO uint32_t HCCHAR13;
    __IO uint32_t HCSPLT13;
    __IO uint32_t HCINT13;
    __IO uint32_t HCINTMSK13;
    __IO uint32_t HCTSIZ13;
    __IO uint32_t HCDMA13;
    uint8_t RESERVED21[8];
    __IO uint32_t HCCHAR14;
    __IO uint32_t HCSPLT14;
    __IO uint32_t HCINT14;
    __IO uint32_t HCINTMSK14;
    __IO uint32_t HCTSIZ14;
    __IO uint32_t HCDMA14;
    uint8_t RESERVED22[8];
    __IO uint32_t HCCHAR15;
    __IO uint32_t HCSPLT15;
    __IO uint32_t HCINT15;
    __IO uint32_t HCINTMSK15;
    __IO uint32_t HCTSIZ15;
    __IO uint32_t HCDMA15;
    uint8_t RESERVED23[264];
    __IO uint32_t DCFG;
    __IO uint32_t DCTL;
    __IO uint32_t DSTS;
    uint8_t RESERVED24[4];
    __IO uint32_t DIEPMSK;
    __IO uint32_t DOEPMSK;
    __IO uint32_t DAINT;
    __IO uint32_t DAINTMSK;
    uint8_t RESERVED25[16];
    __IO uint32_t DTHRCTL;
    __IO uint32_t DIEPEMPMSK;
    __IO uint32_t DEACHINT;
    __IO uint32_t DEACHINTMSK;
    uint8_t RESERVED26[4];
    __IO uint32_t DIEPEACHMSK1;
    uint8_t RESERVED27[60];
    __IO uint32_t DOEPEACHMSK1;
    uint8_t RESERVED28[120];
    __IO uint32_t DIEPCTL0;
    uint8_t RESERVED29[4];
    __IO uint32_t DIEPINT0;
    uint8_t RESERVED30[4];
    __IO uint32_t DIEPTSIZ0;
    __IO uint32_t DIEPDMA0;
    __IO uint32_t DTXFSTS0;
    uint8_t RESERVED31[4];
    __IO uint32_t DIEPCTL1;
    uint8_t RESERVED32[4];
    __IO uint32_t DIEPINT1;
    uint8_t RESERVED33[4];
    __IO uint32_t DIEPTSIZ1;
    __IO uint32_t DIEPDMA1;
    __IO uint32_t DTXFSTS1;
    uint8_t RESERVED34[4];
    __IO uint32_t DIEPCTL2;
    uint8_t RESERVED35[4];
    __IO uint32_t DIEPINT2;
    uint8_t RESERVED36[4];
    __IO uint32_t DIEPTSIZ2;
    __IO uint32_t DIEPDMA2;
    __IO uint32_t DTXFSTS2;
    uint8_t RESERVED37[4];
    __IO uint32_t DIEPCTL3;
    uint8_t RESERVED38[4];
    __IO uint32_t DIEPINT3;
    uint8_t RESERVED39[4];
    __IO uint32_t DIEPTSIZ3;
    __IO uint32_t DIEPDMA3;
    __IO uint32_t DTXFSTS3;
    uint8_t RESERVED40[4];
    __IO uint32_t DIEPCTL4;
    uint8_t RESERVED41[4];
    __IO uint32_t DIEPINT4;
    uint8_t RESERVED42[4];
    __IO uint32_t DIEPTSIZ4;
    __IO uint32_t DIEPDMA4;
    __IO uint32_t DTXFSTS4;
    uint8_t RESERVED43[4];
    __IO uint32_t DIEPCTL5;
    uint8_t RESERVED44[4];
    __IO uint32_t DIEPINT5;
    uint8_t RESERVED45[4];
    __IO uint32_t DIEPTSIZ5;
    __IO uint32_t DIEPDMA5;
    __IO uint32_t DTXFSTS5;
    uint8_t RESERVED46[4];
    __IO uint32_t DIEPCTL6;
    uint8_t RESERVED47[4];
    __IO uint32_t DIEPINT6;
    uint8_t RESERVED48[4];
    __IO uint32_t DIEPTSIZ6;
    __IO uint32_t DIEPDMA6;
    __IO uint32_t DTXFSTS6;
    uint8_t RESERVED49[4];
    __IO uint32_t DIEPCTL7;
    uint8_t RESERVED50[4];
    __IO uint32_t DIEPINT7;
    uint8_t RESERVED51[4];
    __IO uint32_t DIEPTSIZ7;
    __IO uint32_t DIEPDMA7;
    __IO uint32_t DTXFSTS7;
    uint8_t RESERVED52[4];
    __IO uint32_t DIEPCTL8;
    uint8_t RESERVED53[4];
    __IO uint32_t DIEPINT8;
    uint8_t RESERVED54[4];
    __IO uint32_t DIEPTSIZ8;
    __IO uint32_t DIEPDMA8;
    __IO uint32_t DTXFSTS8;
    uint8_t RESERVED55[4];
    __IO uint32_t DIEPCTL9;
    uint8_t RESERVED56[4];
    __IO uint32_t DIEPINT9;
    uint8_t RESERVED57[4];
    __IO uint32_t DIEPTSIZ9;
    __IO uint32_t DIEPDMA9;
    __IO uint32_t DTXFSTS9;
    uint8_t RESERVED58[4];
    __IO uint32_t DIEPCTL10;
    uint8_t RESERVED59[4];
    __IO uint32_t DIEPINT10;
    uint8_t RESERVED60[4];
    __IO uint32_t DIEPTSIZ10;
    __IO uint32_t DIEPDMA10;
    __IO uint32_t DTXFSTS10;
    uint8_t RESERVED61[4];
    __IO uint32_t DIEPCTL11;
    uint8_t RESERVED62[4];
    __IO uint32_t DIEPINT11;
    uint8_t RESERVED63[4];
    __IO uint32_t DIEPTSIZ11;
    __IO uint32_t DIEPDMA11;
    __IO uint32_t DTXFSTS11;
    uint8_t RESERVED64[4];
    __IO uint32_t DIEPCTL12;
    uint8_t RESERVED65[4];
    __IO uint32_t DIEPINT12;
    uint8_t RESERVED66[4];
    __IO uint32_t DIEPTSIZ12;
    __IO uint32_t DIEPDMA12;
    __IO uint32_t DTXFSTS12;
    uint8_t RESERVED67[4];
    __IO uint32_t DIEPCTL13;
    uint8_t RESERVED68[4];
    __IO uint32_t DIEPINT13;
    uint8_t RESERVED69[4];
    __IO uint32_t DIEPTSIZ13;
    __IO uint32_t DIEPDMA13;
    __IO uint32_t DTXFSTS13;
    uint8_t RESERVED70[4];
    __IO uint32_t DIEPCTL14;
    uint8_t RESERVED71[4];
    __IO uint32_t DIEPINT14;
    uint8_t RESERVED72[4];
    __IO uint32_t DIEPTSIZ14;
    __IO uint32_t DIEPDMA14;
    __IO uint32_t DTXFSTS14;
    uint8_t RESERVED73[4];
    __IO uint32_t DIEPCTL15;
    uint8_t RESERVED74[4];
    __IO uint32_t DIEPINT15;
    uint8_t RESERVED75[4];
    __IO uint32_t DIEPTSIZ15;
    __IO uint32_t DIEPDMA15;
    __IO uint32_t DTXFSTS15;
    uint8_t RESERVED76[4];
    __IO uint32_t DOEPCTL0;
    uint8_t RESERVED77[4];
    __IO uint32_t DOEPINT0;
    uint8_t RESERVED78[4];
    __IO uint32_t DOEPTSIZ0;
    __IO uint32_t DOEPDMA0;
    uint8_t RESERVED79[8];
    __IO uint32_t DOEPCTL1;
    uint8_t RESERVED80[4];
    __IO uint32_t DOEPINT1;
    uint8_t RESERVED81[4];
    __IO uint32_t DOEPTSIZ1;
    __IO uint32_t DOEPDMA1;
    uint8_t RESERVED82[8];
    __IO uint32_t DOEPCTL2;
    uint8_t RESERVED83[4];
    __IO uint32_t DOEPINT2;
    uint8_t RESERVED84[4];
    __IO uint32_t DOEPTSIZ2;
    __IO uint32_t DOEPDMA2;
    uint8_t RESERVED85[8];
    __IO uint32_t DOEPCTL3;
    uint8_t RESERVED86[4];
    __IO uint32_t DOEPINT3;
    uint8_t RESERVED87[4];
    __IO uint32_t DOEPTSIZ3;
    __IO uint32_t DOEPDMA3;
    uint8_t RESERVED88[8];
    __IO uint32_t DOEPCTL4;
    uint8_t RESERVED89[4];
    __IO uint32_t DOEPINT4;
    uint8_t RESERVED90[4];
    __IO uint32_t DOEPTSIZ4;
    __IO uint32_t DOEPDMA4;
    uint8_t RESERVED91[8];
    __IO uint32_t DOEPCTL5;
    uint8_t RESERVED92[4];
    __IO uint32_t DOEPINT5;
    uint8_t RESERVED93[4];
    __IO uint32_t DOEPTSIZ5;
    __IO uint32_t DOEPDMA5;
    uint8_t RESERVED94[8];
    __IO uint32_t DOEPCTL6;
    uint8_t RESERVED95[4];
    __IO uint32_t DOEPINT6;
    uint8_t RESERVED96[4];
    __IO uint32_t DOEPTSIZ6;
    __IO uint32_t DOEPDMA6;
    uint8_t RESERVED97[8];
    __IO uint32_t DOEPCTL7;
    uint8_t RESERVED98[4];
    __IO uint32_t DOEPINT7;
    uint8_t RESERVED99[4];
    __IO uint32_t DOEPTSIZ7;
    __IO uint32_t DOEPDMA7;
    uint8_t RESERVED100[8];
    __IO uint32_t DOEPCTL8;
    uint8_t RESERVED101[4];
    __IO uint32_t DOEPINT8;
    uint8_t RESERVED102[4];
    __IO uint32_t DOEPTSIZ8;
    __IO uint32_t DOEPDMA8;
    uint8_t RESERVED103[8];
    __IO uint32_t DOEPCTL9;
    uint8_t RESERVED104[4];
    __IO uint32_t DOEPINT9;
    uint8_t RESERVED105[4];
    __IO uint32_t DOEPTSIZ9;
    __IO uint32_t DOEPDMA9;
    uint8_t RESERVED106[8];
    __IO uint32_t DOEPCTL10;
    uint8_t RESERVED107[4];
    __IO uint32_t DOEPINT10;
    uint8_t RESERVED108[4];
    __IO uint32_t DOEPTSIZ10;
    __IO uint32_t DOEPDMA10;
    uint8_t RESERVED109[8];
    __IO uint32_t DOEPCTL11;
    uint8_t RESERVED110[4];
    __IO uint32_t DOEPINT11;
    uint8_t RESERVED111[4];
    __IO uint32_t DOEPTSIZ11;
    __IO uint32_t DOEPDMA11;
    uint8_t RESERVED112[8];
    __IO uint32_t DOEPCTL12;
    uint8_t RESERVED113[4];
    __IO uint32_t DOEPINT12;
    uint8_t RESERVED114[4];
    __IO uint32_t DOEPTSIZ12;
    __IO uint32_t DOEPDMA12;
    uint8_t RESERVED115[8];
    __IO uint32_t DOEPCTL13;
    uint8_t RESERVED116[4];
    __IO uint32_t DOEPINT13;
    uint8_t RESERVED117[4];
    __IO uint32_t DOEPTSIZ13;
    __IO uint32_t DOEPDMA13;
    uint8_t RESERVED118[8];
    __IO uint32_t DOEPCTL14;
    uint8_t RESERVED119[4];
    __IO uint32_t DOEPINT14;
    uint8_t RESERVED120[4];
    __IO uint32_t DOEPTSIZ14;
    __IO uint32_t DOEPDMA14;
    uint8_t RESERVED121[8];
    __IO uint32_t DOEPCTL15;
    uint8_t RESERVED122[4];
    __IO uint32_t DOEPINT15;
    uint8_t RESERVED123[4];
    __IO uint32_t DOEPTSIZ15;
    __IO uint32_t DOEPDMA15;
    uint8_t RESERVED124[264];
    __IO uint32_t GCCTL;
} M4_USBHS_TypeDef;

/**
 * @brief WDT
 */
typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t SR;
    __IO uint32_t RR;
} M4_WDT_TypeDef;



/******************************************************************************/
/*           Device Specific Peripheral declaration & memory map              */
/******************************************************************************/

#define M4_ADC1                              ((M4_ADC_TypeDef *)0x40040000UL)
#define M4_ADC2                              ((M4_ADC_TypeDef *)0x40040400UL)
#define M4_ADC3                              ((M4_ADC_TypeDef *)0x40040800UL)
#define M4_AES                               ((M4_AES_TypeDef *)0x40008000UL)
#define M4_AOS                               ((M4_AOS_TypeDef *)0x40010800UL)
#define M4_CAN1                              ((M4_CAN_TypeDef *)0x40009000UL)
#define M4_CAN2                              ((M4_CAN_TypeDef *)0x40078000UL)
#define M4_CMP1                              ((M4_CMP_TypeDef *)0x4004A000UL)
#define M4_CMP2                              ((M4_CMP_TypeDef *)0x4004A010UL)
#define M4_CMP3                              ((M4_CMP_TypeDef *)0x4004A400UL)
#define M4_CMP4                              ((M4_CMP_TypeDef *)0x4004A410UL)
#define M4_CMU                               ((M4_CMU_TypeDef *)0x4004C400UL)
#define M4_CRC                               ((M4_CRC_TypeDef *)0x40008C00UL)
#define M4_CTC                               ((M4_CTC_TypeDef *)0x40049C00UL)
#define M4_DAC1                              ((M4_DAC_TypeDef *)0x40041000UL)
#define M4_DAC2                              ((M4_DAC_TypeDef *)0x40041400UL)
#define M4_DBGC                              ((M4_DBGC_TypeDef *)0xE0042000UL)
#define M4_DCU1                              ((M4_DCU_TypeDef *)0x40056000UL)
#define M4_DCU2                              ((M4_DCU_TypeDef *)0x40056400UL)
#define M4_DCU3                              ((M4_DCU_TypeDef *)0x40056800UL)
#define M4_DCU4                              ((M4_DCU_TypeDef *)0x40056C00UL)
#define M4_DCU5                              ((M4_DCU_TypeDef *)0x40057000UL)
#define M4_DCU6                              ((M4_DCU_TypeDef *)0x40057400UL)
#define M4_DCU7                              ((M4_DCU_TypeDef *)0x40057800UL)
#define M4_DCU8                              ((M4_DCU_TypeDef *)0x40057C00UL)
#define M4_DMA1                              ((M4_DMA_TypeDef *)0x40053000UL)
#define M4_DMA2                              ((M4_DMA_TypeDef *)0x40053400UL)
#define M4_DMC                               ((M4_DMC_TypeDef *)0x88000400UL)
#define M4_DVP                               ((M4_DVP_TypeDef *)0x40055800UL)
#define M4_EFM                               ((M4_EFM_TypeDef *)0x40010400UL)
#define M4_EMB0                              ((M4_EMB_TypeDef *)0x40017C00UL)
#define M4_EMB1                              ((M4_EMB_TypeDef *)0x40017C20UL)
#define M4_EMB2                              ((M4_EMB_TypeDef *)0x40017C40UL)
#define M4_EMB3                              ((M4_EMB_TypeDef *)0x40017C60UL)
#define M4_EMB4                              ((M4_EMB_TypeDef *)0x40017C80UL)
#define M4_EMB5                              ((M4_EMB_TypeDef *)0x40017CA0UL)
#define M4_EMB6                              ((M4_EMB_TypeDef *)0x40017CC0UL)
#define M4_ETH                               ((M4_ETH_TypeDef *)0x40050000UL)
#define M4_FCM                               ((M4_FCM_TypeDef *)0x40048400UL)
#define M4_FMAC1                             ((M4_FMAC_TypeDef *)0x40058000UL)
#define M4_FMAC2                             ((M4_FMAC_TypeDef *)0x40058400UL)
#define M4_FMAC3                             ((M4_FMAC_TypeDef *)0x40058800UL)
#define M4_FMAC4                             ((M4_FMAC_TypeDef *)0x40058C00UL)
#define M4_GPIO                              ((M4_GPIO_TypeDef *)0x40053800UL)
#define M4_HASH                              ((M4_HASH_TypeDef *)0x40008400UL)
#define M4_HRPWM                             ((M4_HRPWM_TypeDef *)0x4003C000UL)
#define M4_I2C1                              ((M4_I2C_TypeDef *)0x4004E000UL)
#define M4_I2C2                              ((M4_I2C_TypeDef *)0x4004E400UL)
#define M4_I2C3                              ((M4_I2C_TypeDef *)0x4004E800UL)
#define M4_I2C4                              ((M4_I2C_TypeDef *)0x4004EC00UL)
#define M4_I2C5                              ((M4_I2C_TypeDef *)0x4004F000UL)
#define M4_I2C6                              ((M4_I2C_TypeDef *)0x4004F800UL)
#define M4_I2S1                              ((M4_I2S_TypeDef *)0x4001E000UL)
#define M4_I2S2                              ((M4_I2S_TypeDef *)0x4001E400UL)
#define M4_I2S3                              ((M4_I2S_TypeDef *)0x40022000UL)
#define M4_I2S4                              ((M4_I2S_TypeDef *)0x40022400UL)
#define M4_ICG                               ((M4_ICG_TypeDef *)0x00000400UL)
#define M4_INTC                              ((M4_INTC_TypeDef *)0x40051000UL)
#define M4_KEYSCAN                           ((M4_KEYSCAN_TypeDef *)0x40050C00UL)
#define M4_MAU                               ((M4_MAU_TypeDef *)0x40055000UL)
#define M4_MPU                               ((M4_MPU_TypeDef *)0x40050000UL)
#define M4_NFC                               ((M4_NFC_TypeDef *)0x88100000UL)
#define M4_OTS                               ((M4_OTS_TypeDef *)0x40010600UL)
#define M4_PERIC                             ((M4_PERIC_TypeDef *)0x40055400UL)
#define M4_PWC                               ((M4_PWC_TypeDef *)0x40048000UL)
#define M4_QSPI                              ((M4_QSPI_TypeDef *)0x9C000000UL)
#define M4_RMU                               ((M4_RMU_TypeDef *)0x4004CC00UL)
#define M4_RTC                               ((M4_RTC_TypeDef *)0x4004C000UL)
#define M4_SDIOC1                            ((M4_SDIOC_TypeDef *)0x40070000UL)
#define M4_SDIOC2                            ((M4_SDIOC_TypeDef *)0x40078400UL)
#define M4_SMC                               ((M4_SMC_TypeDef *)0x88000000UL)
#define M4_SPI1                              ((M4_SPI_TypeDef *)0x4001C000UL)
#define M4_SPI2                              ((M4_SPI_TypeDef *)0x4001C400UL)
#define M4_SPI3                              ((M4_SPI_TypeDef *)0x4001C800UL)
#define M4_SPI4                              ((M4_SPI_TypeDef *)0x40020000UL)
#define M4_SPI5                              ((M4_SPI_TypeDef *)0x40020400UL)
#define M4_SPI6                              ((M4_SPI_TypeDef *)0x40020800UL)
#define M4_SRAMC                             ((M4_SRAMC_TypeDef *)0x40050800UL)
#define M4_SWDT                              ((M4_SWDT_TypeDef *)0x40049400UL)
#define M4_TMR0_1                            ((M4_TMR0_TypeDef *)0x40024000UL)
#define M4_TMR0_2                            ((M4_TMR0_TypeDef *)0x40024400UL)
#define M4_TMR2_1                            ((M4_TMR2_TypeDef *)0x40024800UL)
#define M4_TMR2_2                            ((M4_TMR2_TypeDef *)0x40024C00UL)
#define M4_TMR2_3                            ((M4_TMR2_TypeDef *)0x40025000UL)
#define M4_TMR2_4                            ((M4_TMR2_TypeDef *)0x40025400UL)
#define M4_TMR4_1                            ((M4_TMR4_TypeDef *)0x40038000UL)
#define M4_TMR4_2                            ((M4_TMR4_TypeDef *)0x40038400UL)
#define M4_TMR4_3                            ((M4_TMR4_TypeDef *)0x40038800UL)
#define M4_TMR6_1                            ((M4_TMR6_TypeDef *)0x40018000UL)
#define M4_TMR6_2                            ((M4_TMR6_TypeDef *)0x40018400UL)
#define M4_TMR6_3                            ((M4_TMR6_TypeDef *)0x40018800UL)
#define M4_TMR6_4                            ((M4_TMR6_TypeDef *)0x40018C00UL)
#define M4_TMR6_5                            ((M4_TMR6_TypeDef *)0x40019000UL)
#define M4_TMR6_6                            ((M4_TMR6_TypeDef *)0x40019400UL)
#define M4_TMR6_7                            ((M4_TMR6_TypeDef *)0x40019800UL)
#define M4_TMR6_8                            ((M4_TMR6_TypeDef *)0x40019C00UL)
#define M4_TMRA_1                            ((M4_TMRA_TypeDef *)0x4003A000UL)
#define M4_TMRA_10                           ((M4_TMRA_TypeDef *)0x40027400UL)
#define M4_TMRA_11                           ((M4_TMRA_TypeDef *)0x40027800UL)
#define M4_TMRA_12                           ((M4_TMRA_TypeDef *)0x40027C00UL)
#define M4_TMRA_2                            ((M4_TMRA_TypeDef *)0x4003A400UL)
#define M4_TMRA_3                            ((M4_TMRA_TypeDef *)0x4003A800UL)
#define M4_TMRA_4                            ((M4_TMRA_TypeDef *)0x4003AC00UL)
#define M4_TMRA_5                            ((M4_TMRA_TypeDef *)0x40026000UL)
#define M4_TMRA_6                            ((M4_TMRA_TypeDef *)0x40026400UL)
#define M4_TMRA_7                            ((M4_TMRA_TypeDef *)0x40026800UL)
#define M4_TMRA_8                            ((M4_TMRA_TypeDef *)0x40026C00UL)
#define M4_TMRA_9                            ((M4_TMRA_TypeDef *)0x40027000UL)
#define M4_TRNG                              ((M4_TRNG_TypeDef *)0x40042000UL)
#define M4_USART1                            ((M4_USART_TypeDef *)0x4001CC00UL)
#define M4_USART10                           ((M4_USART_TypeDef *)0x40021C00UL)
#define M4_USART2                            ((M4_USART_TypeDef *)0x4001D000UL)
#define M4_USART3                            ((M4_USART_TypeDef *)0x4001D400UL)
#define M4_USART4                            ((M4_USART_TypeDef *)0x4001D800UL)
#define M4_USART5                            ((M4_USART_TypeDef *)0x4001DC00UL)
#define M4_USART6                            ((M4_USART_TypeDef *)0x40020C00UL)
#define M4_USART7                            ((M4_USART_TypeDef *)0x40021000UL)
#define M4_USART8                            ((M4_USART_TypeDef *)0x40021400UL)
#define M4_USART9                            ((M4_USART_TypeDef *)0x40021800UL)
#define M4_USBFS                             ((M4_USBFS_TypeDef *)0x40080000UL)
#define M4_USBHS                             ((M4_USBHS_TypeDef *)0x400C0000UL)
#define M4_WDT                               ((M4_WDT_TypeDef *)0x40049000UL)


/******************************************************************************/
/*                   Peripheral Registers Bits Definition                     */
/******************************************************************************/

