SoCXin/HC32F4A0/src/hc32f4a0pitb_template/common/hc32f4a0pitb.h
/*  Bit definition for NFC_ECC_SYND0_2 register  */
#define NFC_ECC_SYND0_2_S5_POS                         (0U)
#define NFC_ECC_SYND0_2_S5                             (0x00001FFFUL)
#define NFC_ECC_SYND0_2_S6_POS                         (16U)
#define NFC_ECC_SYND0_2_S6                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND0_3 register  */
#define NFC_ECC_SYND0_3_S7_POS                         (0U)
#define NFC_ECC_SYND0_3_S7                             (0x00001FFFUL)
#define NFC_ECC_SYND0_3_S8_POS                         (16U)
#define NFC_ECC_SYND0_3_S8                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND1_0 register  */
#define NFC_ECC_SYND1_0_S1_POS                         (0U)
#define NFC_ECC_SYND1_0_S1                             (0x00001FFFUL)
#define NFC_ECC_SYND1_0_S2_POS                         (16U)
#define NFC_ECC_SYND1_0_S2                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND1_1 register  */
#define NFC_ECC_SYND1_1_S3_POS                         (0U)
#define NFC_ECC_SYND1_1_S3                             (0x00001FFFUL)
#define NFC_ECC_SYND1_1_S4_POS                         (16U)
#define NFC_ECC_SYND1_1_S4                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND1_2 register  */
#define NFC_ECC_SYND1_2_S5_POS                         (0U)
#define NFC_ECC_SYND1_2_S5                             (0x00001FFFUL)
#define NFC_ECC_SYND1_2_S6_POS                         (16U)
#define NFC_ECC_SYND1_2_S6                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND1_3 register  */
#define NFC_ECC_SYND1_3_S7_POS                         (0U)
#define NFC_ECC_SYND1_3_S7                             (0x00001FFFUL)
#define NFC_ECC_SYND1_3_S8_POS                         (16U)
#define NFC_ECC_SYND1_3_S8                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND2_0 register  */
#define NFC_ECC_SYND2_0_S1_POS                         (0U)
#define NFC_ECC_SYND2_0_S1                             (0x00001FFFUL)
#define NFC_ECC_SYND2_0_S2_POS                         (16U)
#define NFC_ECC_SYND2_0_S2                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND2_1 register  */
#define NFC_ECC_SYND2_1_S3_POS                         (0U)
#define NFC_ECC_SYND2_1_S3                             (0x00001FFFUL)
#define NFC_ECC_SYND2_1_S4_POS                         (16U)
#define NFC_ECC_SYND2_1_S4                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND2_2 register  */
#define NFC_ECC_SYND2_2_S5_POS                         (0U)
#define NFC_ECC_SYND2_2_S5                             (0x00001FFFUL)
#define NFC_ECC_SYND2_2_S6_POS                         (16U)
#define NFC_ECC_SYND2_2_S6                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND2_3 register  */
#define NFC_ECC_SYND2_3_S7_POS                         (0U)
#define NFC_ECC_SYND2_3_S7                             (0x00001FFFUL)
#define NFC_ECC_SYND2_3_S8_POS                         (16U)
#define NFC_ECC_SYND2_3_S8                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND3_0 register  */
#define NFC_ECC_SYND3_0_S1_POS                         (0U)
#define NFC_ECC_SYND3_0_S1                             (0x00001FFFUL)
#define NFC_ECC_SYND3_0_S2_POS                         (16U)
#define NFC_ECC_SYND3_0_S2                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND3_1 register  */
#define NFC_ECC_SYND3_1_S3_POS                         (0U)
#define NFC_ECC_SYND3_1_S3                             (0x00001FFFUL)
#define NFC_ECC_SYND3_1_S4_POS                         (16U)
#define NFC_ECC_SYND3_1_S4                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND3_2 register  */
#define NFC_ECC_SYND3_2_S5_POS                         (0U)
#define NFC_ECC_SYND3_2_S5                             (0x00001FFFUL)
#define NFC_ECC_SYND3_2_S6_POS                         (16U)
#define NFC_ECC_SYND3_2_S6                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND3_3 register  */
#define NFC_ECC_SYND3_3_S7_POS                         (0U)
#define NFC_ECC_SYND3_3_S7                             (0x00001FFFUL)
#define NFC_ECC_SYND3_3_S8_POS                         (16U)
#define NFC_ECC_SYND3_3_S8                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND4_0 register  */
#define NFC_ECC_SYND4_0_S1_POS                         (0U)
#define NFC_ECC_SYND4_0_S1                             (0x00001FFFUL)
#define NFC_ECC_SYND4_0_S2_POS                         (16U)
#define NFC_ECC_SYND4_0_S2                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND4_1 register  */
#define NFC_ECC_SYND4_1_S3_POS                         (0U)
#define NFC_ECC_SYND4_1_S3                             (0x00001FFFUL)
#define NFC_ECC_SYND4_1_S4_POS                         (16U)
#define NFC_ECC_SYND4_1_S4                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND4_2 register  */
#define NFC_ECC_SYND4_2_S5_POS                         (0U)
#define NFC_ECC_SYND4_2_S5                             (0x00001FFFUL)
#define NFC_ECC_SYND4_2_S6_POS                         (16U)
#define NFC_ECC_SYND4_2_S6                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND4_3 register  */
#define NFC_ECC_SYND4_3_S7_POS                         (0U)
#define NFC_ECC_SYND4_3_S7                             (0x00001FFFUL)
#define NFC_ECC_SYND4_3_S8_POS                         (16U)
#define NFC_ECC_SYND4_3_S8                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND5_0 register  */
#define NFC_ECC_SYND5_0_S1_POS                         (0U)
#define NFC_ECC_SYND5_0_S1                             (0x00001FFFUL)
#define NFC_ECC_SYND5_0_S2_POS                         (16U)
#define NFC_ECC_SYND5_0_S2                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND5_1 register  */
#define NFC_ECC_SYND5_1_S3_POS                         (0U)
#define NFC_ECC_SYND5_1_S3                             (0x00001FFFUL)
#define NFC_ECC_SYND5_1_S4_POS                         (16U)
#define NFC_ECC_SYND5_1_S4                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND5_2 register  */
#define NFC_ECC_SYND5_2_S5_POS                         (0U)
#define NFC_ECC_SYND5_2_S5                             (0x00001FFFUL)
#define NFC_ECC_SYND5_2_S6_POS                         (16U)
#define NFC_ECC_SYND5_2_S6                             (0x1FFF0000UL)

