SoCXin/HC32F4A0/src/hc32f4a0pitb_template/common/hc32f4a0pitb.h
/*  Bit definition for PWC_BKR13 register  */
#define PWC_BKR13                                      (0xFFU)

/*  Bit definition for PWC_BKR14 register  */
#define PWC_BKR14                                      (0xFFU)

/*  Bit definition for PWC_BKR15 register  */
#define PWC_BKR15                                      (0xFFU)

/*  Bit definition for PWC_BKR16 register  */
#define PWC_BKR16                                      (0xFFU)

/*  Bit definition for PWC_BKR17 register  */
#define PWC_BKR17                                      (0xFFU)

/*  Bit definition for PWC_BKR18 register  */
#define PWC_BKR18                                      (0xFFU)

/*  Bit definition for PWC_BKR19 register  */
#define PWC_BKR19                                      (0xFFU)

/*  Bit definition for PWC_BKR20 register  */
#define PWC_BKR20                                      (0xFFU)

/*  Bit definition for PWC_BKR21 register  */
#define PWC_BKR21                                      (0xFFU)

/*  Bit definition for PWC_BKR22 register  */
#define PWC_BKR22                                      (0xFFU)

/*  Bit definition for PWC_BKR23 register  */
#define PWC_BKR23                                      (0xFFU)

/*  Bit definition for PWC_BKR24 register  */
#define PWC_BKR24                                      (0xFFU)

/*  Bit definition for PWC_BKR25 register  */
#define PWC_BKR25                                      (0xFFU)

/*  Bit definition for PWC_BKR26 register  */
#define PWC_BKR26                                      (0xFFU)

/*  Bit definition for PWC_BKR27 register  */
#define PWC_BKR27                                      (0xFFU)

/*  Bit definition for PWC_BKR28 register  */
#define PWC_BKR28                                      (0xFFU)

/*  Bit definition for PWC_BKR29 register  */
#define PWC_BKR29                                      (0xFFU)

/*  Bit definition for PWC_BKR30 register  */
#define PWC_BKR30                                      (0xFFU)

/*  Bit definition for PWC_BKR31 register  */
#define PWC_BKR31                                      (0xFFU)

/*  Bit definition for PWC_BKR32 register  */
#define PWC_BKR32                                      (0xFFU)

/*  Bit definition for PWC_BKR33 register  */
#define PWC_BKR33                                      (0xFFU)

/*  Bit definition for PWC_BKR34 register  */
#define PWC_BKR34                                      (0xFFU)

/*  Bit definition for PWC_BKR35 register  */
#define PWC_BKR35                                      (0xFFU)

/*  Bit definition for PWC_BKR36 register  */
#define PWC_BKR36                                      (0xFFU)

/*  Bit definition for PWC_BKR37 register  */
#define PWC_BKR37                                      (0xFFU)

/*  Bit definition for PWC_BKR38 register  */
#define PWC_BKR38                                      (0xFFU)

/*  Bit definition for PWC_BKR39 register  */
#define PWC_BKR39                                      (0xFFU)

/*  Bit definition for PWC_BKR40 register  */
#define PWC_BKR40                                      (0xFFU)

/*  Bit definition for PWC_BKR41 register  */
#define PWC_BKR41                                      (0xFFU)

/*  Bit definition for PWC_BKR42 register  */
#define PWC_BKR42                                      (0xFFU)

/*  Bit definition for PWC_BKR43 register  */
#define PWC_BKR43                                      (0xFFU)

/*  Bit definition for PWC_BKR44 register  */
#define PWC_BKR44                                      (0xFFU)

/*  Bit definition for PWC_BKR45 register  */
#define PWC_BKR45                                      (0xFFU)

/*  Bit definition for PWC_BKR46 register  */
#define PWC_BKR46                                      (0xFFU)

/*  Bit definition for PWC_BKR47 register  */
#define PWC_BKR47                                      (0xFFU)

/*  Bit definition for PWC_BKR48 register  */
#define PWC_BKR48                                      (0xFFU)

/*  Bit definition for PWC_BKR49 register  */
#define PWC_BKR49                                      (0xFFU)

/*  Bit definition for PWC_BKR50 register  */
#define PWC_BKR50                                      (0xFFU)

/*  Bit definition for PWC_BKR51 register  */
#define PWC_BKR51                                      (0xFFU)

/*  Bit definition for PWC_BKR52 register  */
#define PWC_BKR52                                      (0xFFU)

/*  Bit definition for PWC_BKR53 register  */
#define PWC_BKR53                                      (0xFFU)

/*  Bit definition for PWC_BKR54 register  */
#define PWC_BKR54                                      (0xFFU)

/*  Bit definition for PWC_BKR55 register  */
#define PWC_BKR55                                      (0xFFU)

/*  Bit definition for PWC_BKR56 register  */
#define PWC_BKR56                                      (0xFFU)

/*  Bit definition for PWC_BKR57 register  */
#define PWC_BKR57                                      (0xFFU)

/*  Bit definition for PWC_BKR58 register  */
#define PWC_BKR58                                      (0xFFU)

/*  Bit definition for PWC_BKR59 register  */
#define PWC_BKR59                                      (0xFFU)

/*  Bit definition for PWC_BKR60 register  */
#define PWC_BKR60                                      (0xFFU)

/*  Bit definition for PWC_BKR61 register  */
#define PWC_BKR61                                      (0xFFU)

/*  Bit definition for PWC_BKR62 register  */
#define PWC_BKR62                                      (0xFFU)

/*  Bit definition for PWC_BKR63 register  */
#define PWC_BKR63                                      (0xFFU)

/*  Bit definition for PWC_BKR64 register  */
#define PWC_BKR64                                      (0xFFU)

/*  Bit definition for PWC_BKR65 register  */
#define PWC_BKR65                                      (0xFFU)

/*  Bit definition for PWC_BKR66 register  */
#define PWC_BKR66                                      (0xFFU)

/*  Bit definition for PWC_BKR67 register  */
#define PWC_BKR67                                      (0xFFU)

/*  Bit definition for PWC_BKR68 register  */
#define PWC_BKR68                                      (0xFFU)

/*  Bit definition for PWC_BKR69 register  */
#define PWC_BKR69                                      (0xFFU)

/*  Bit definition for PWC_BKR70 register  */
#define PWC_BKR70                                      (0xFFU)

/*  Bit definition for PWC_BKR71 register  */
#define PWC_BKR71                                      (0xFFU)

