SoCXin/HC32F4A0/src/hc32f4a0pitb_template/common/hc32f4a0pitb.h
/*  Bit definition for TMR6_SCLRR register  */
#define TMR6_SCLRR_SCLE1_POS                           (0U)
#define TMR6_SCLRR_SCLE1                               (0x00000001UL)
#define TMR6_SCLRR_SCLE2_POS                           (1U)
#define TMR6_SCLRR_SCLE2                               (0x00000002UL)
#define TMR6_SCLRR_SCLE3_POS                           (2U)
#define TMR6_SCLRR_SCLE3                               (0x00000004UL)
#define TMR6_SCLRR_SCLE4_POS                           (3U)
#define TMR6_SCLRR_SCLE4                               (0x00000008UL)
#define TMR6_SCLRR_SCLE5_POS                           (4U)
#define TMR6_SCLRR_SCLE5                               (0x00000010UL)
#define TMR6_SCLRR_SCLE6_POS                           (5U)
#define TMR6_SCLRR_SCLE6                               (0x00000020UL)
#define TMR6_SCLRR_SCLE7_POS                           (6U)
#define TMR6_SCLRR_SCLE7                               (0x00000040UL)
#define TMR6_SCLRR_SCLE8_POS                           (7U)
#define TMR6_SCLRR_SCLE8                               (0x00000080UL)

/*  Bit definition for TMR6_SUPDR register  */
#define TMR6_SUPDR_SUPD1_POS                           (0U)
#define TMR6_SUPDR_SUPD1                               (0x00000001UL)
#define TMR6_SUPDR_SUPD2_POS                           (1U)
#define TMR6_SUPDR_SUPD2                               (0x00000002UL)
#define TMR6_SUPDR_SUPD3_POS                           (2U)
#define TMR6_SUPDR_SUPD3                               (0x00000004UL)
#define TMR6_SUPDR_SUPD4_POS                           (3U)
#define TMR6_SUPDR_SUPD4                               (0x00000008UL)
#define TMR6_SUPDR_SUPD5_POS                           (4U)
#define TMR6_SUPDR_SUPD5                               (0x00000010UL)
#define TMR6_SUPDR_SUPD6_POS                           (5U)
#define TMR6_SUPDR_SUPD6                               (0x00000020UL)
#define TMR6_SUPDR_SUPD7_POS                           (6U)
#define TMR6_SUPDR_SUPD7                               (0x00000040UL)
#define TMR6_SUPDR_SUPD8_POS                           (7U)
#define TMR6_SUPDR_SUPD8                               (0x00000080UL)

/*******************************************************************************
                Bit definition for Peripheral TMRA
*******************************************************************************/
/*  Bit definition for TMRA_CNTER register  */
#define TMRA_CNTER_CNT                                 (0x0000FFFFUL)

/*  Bit definition for TMRA_PERAR register  */
#define TMRA_PERAR_PER                                 (0x0000FFFFUL)

/*  Bit definition for TMRA_CMPAR1 register  */
#define TMRA_CMPAR1_CMP                                (0x0000FFFFUL)

/*  Bit definition for TMRA_CMPAR2 register  */
#define TMRA_CMPAR2_CMP                                (0x0000FFFFUL)

/*  Bit definition for TMRA_CMPAR3 register  */
#define TMRA_CMPAR3_CMP                                (0x0000FFFFUL)

/*  Bit definition for TMRA_CMPAR4 register  */
#define TMRA_CMPAR4_CMP                                (0x0000FFFFUL)

/*  Bit definition for TMRA_BCSTR register  */
#define TMRA_BCSTR_START_POS                           (0U)
#define TMRA_BCSTR_START                               (0x00000001UL)
#define TMRA_BCSTR_DIR_POS                             (1U)
#define TMRA_BCSTR_DIR                                 (0x00000002UL)
#define TMRA_BCSTR_MODE_POS                            (2U)
#define TMRA_BCSTR_MODE                                (0x00000004UL)
#define TMRA_BCSTR_SYNST_POS                           (3U)
#define TMRA_BCSTR_SYNST                               (0x00000008UL)
#define TMRA_BCSTR_CKDIV_POS                           (4U)
#define TMRA_BCSTR_CKDIV                               (0x000000F0UL)
#define TMRA_BCSTR_OVSTP_POS                           (8U)
#define TMRA_BCSTR_OVSTP                               (0x00000100UL)
#define TMRA_BCSTR_ITENOVF_POS                         (12U)
#define TMRA_BCSTR_ITENOVF                             (0x00001000UL)
#define TMRA_BCSTR_ITENUDF_POS                         (13U)
#define TMRA_BCSTR_ITENUDF                             (0x00002000UL)
#define TMRA_BCSTR_OVFF_POS                            (14U)
#define TMRA_BCSTR_OVFF                                (0x00004000UL)
#define TMRA_BCSTR_UDFF_POS                            (15U)
#define TMRA_BCSTR_UDFF                                (0x00008000UL)

/*  Bit definition for TMRA_HCONR register  */
#define TMRA_HCONR_HSTA0_POS                           (0U)
#define TMRA_HCONR_HSTA0                               (0x00000001UL)
#define TMRA_HCONR_HSTA1_POS                           (1U)
#define TMRA_HCONR_HSTA1                               (0x00000002UL)
#define TMRA_HCONR_HSTA2_POS                           (2U)
#define TMRA_HCONR_HSTA2                               (0x00000004UL)
#define TMRA_HCONR_HSTP0_POS                           (4U)
#define TMRA_HCONR_HSTP0                               (0x00000010UL)
#define TMRA_HCONR_HSTP1_POS                           (5U)
#define TMRA_HCONR_HSTP1                               (0x00000020UL)
#define TMRA_HCONR_HSTP2_POS                           (6U)
#define TMRA_HCONR_HSTP2                               (0x00000040UL)
#define TMRA_HCONR_HCLE0_POS                           (8U)
#define TMRA_HCONR_HCLE0                               (0x00000100UL)
#define TMRA_HCONR_HCLE1_POS                           (9U)
#define TMRA_HCONR_HCLE1                               (0x00000200UL)
#define TMRA_HCONR_HCLE2_POS                           (10U)
#define TMRA_HCONR_HCLE2                               (0x00000400UL)
#define TMRA_HCONR_HCLE3_POS                           (12U)
#define TMRA_HCONR_HCLE3                               (0x00001000UL)
#define TMRA_HCONR_HCLE4_POS                           (13U)
#define TMRA_HCONR_HCLE4                               (0x00002000UL)
#define TMRA_HCONR_HCLE5_POS                           (14U)
#define TMRA_HCONR_HCLE5                               (0x00004000UL)
#define TMRA_HCONR_HCLE6_POS                           (15U)
#define TMRA_HCONR_HCLE6                               (0x00008000UL)

