SoCXin/HC32F4A0/src/hc32f4a0pitb_template/common/hc32f4a0pitb.h
typedef struct
{
    __IO uint32_t TMOUTEN;
    __IO uint32_t LTMOUT;
    __IO uint32_t HTMOUT;
    uint32_t RESERVED0[4];
    __IO uint32_t FACKEN;
    uint32_t RESERVED1[24];
} stc_i2c_cr3_bit_t;

typedef struct
{
    uint32_t RESERVED0[10];
    __IO uint32_t BUSWAIT;
    uint32_t RESERVED1[21];
} stc_i2c_cr4_bit_t;

typedef struct
{
    uint32_t RESERVED0[12];
    __IO uint32_t SLADDR0EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD0;
    uint32_t RESERVED2[16];
} stc_i2c_slr0_bit_t;

typedef struct
{
    uint32_t RESERVED0[12];
    __IO uint32_t SLADDR1EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD1;
    uint32_t RESERVED2[16];
} stc_i2c_slr1_bit_t;

typedef struct
{
    __IO uint32_t STARTF;
    __IO uint32_t SLADDR0F;
    __IO uint32_t SLADDR1F;
    __IO uint32_t TENDF;
    __IO uint32_t STOPF;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLF;
    __IO uint32_t TEMPTYF;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOF;
    __IO uint32_t ACKRF;
    uint32_t RESERVED2[1];
    __IO uint32_t NACKF;
    uint32_t RESERVED3[1];
    __IO uint32_t TMOUTF;
    uint32_t RESERVED4[1];
    __IO uint32_t MSL;
    __IO uint32_t BUSY;
    __IO uint32_t TRA;
    uint32_t RESERVED5[1];
    __IO uint32_t GENCALLF;
    __IO uint32_t SMBDEFAULTF;
    __IO uint32_t SMBHOSTF;
    __IO uint32_t SMBALRTF;
    uint32_t RESERVED6[8];
} stc_i2c_sr_bit_t;

typedef struct
{
    __IO uint32_t STARTFCLR;
    __IO uint32_t SLADDR0FCLR;
    __IO uint32_t SLADDR1FCLR;
    __IO uint32_t TENDFCLR;
    __IO uint32_t STOPFCLR;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLFCLR;
    __IO uint32_t TEMPTYFCLR;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOFCLR;
    uint32_t RESERVED2[2];
    __IO uint32_t NACKFCLR;
    uint32_t RESERVED3[1];
    __IO uint32_t TMOUTFCLR;
    uint32_t RESERVED4[5];
    __IO uint32_t GENCALLFCLR;
    __IO uint32_t SMBDEFAULTFCLR;
    __IO uint32_t SMBHOSTFCLR;
    __IO uint32_t SMBALRTFCLR;
    uint32_t RESERVED5[8];
} stc_i2c_clr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_i2c_dtr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_i2c_drr_bit_t;

typedef struct
{
    uint32_t RESERVED0[4];
    __IO uint32_t DNFEN;
    __IO uint32_t ANFEN;
    uint32_t RESERVED1[26];
} stc_i2c_fltr_bit_t;

typedef struct
{
    __IO uint32_t TXE;
    __IO uint32_t TXIE;
    __IO uint32_t RXE;
    __IO uint32_t RXIE;
    __IO uint32_t EIE;
    __IO uint32_t WMS;
    __IO uint32_t ODD;
    __IO uint32_t MCKOE;
    __IO uint32_t TXBIRQWL0;
    __IO uint32_t TXBIRQWL1;
    __IO uint32_t TXBIRQWL2;
    uint32_t RESERVED0[1];
    __IO uint32_t RXBIRQWL0;
    __IO uint32_t RXBIRQWL1;
    __IO uint32_t RXBIRQWL2;
    uint32_t RESERVED1[1];
    __IO uint32_t FIFOR;
    __IO uint32_t CODECRC;
    __IO uint32_t I2SPLLSEL;
    __IO uint32_t SDOE;
    __IO uint32_t LRCKOE;
    __IO uint32_t CKOE;
    __IO uint32_t DUPLEX;
    __IO uint32_t CLKSEL;
    __IO uint32_t SRST;
    uint32_t RESERVED2[7];
} stc_i2s_ctrl_bit_t;

typedef struct
{
    __IO uint32_t TXBA;
    __IO uint32_t RXBA;
    __IO uint32_t TXBE;
    __IO uint32_t TXBF;
    __IO uint32_t RXBE;
    __IO uint32_t RXBF;
    uint32_t RESERVED0[26];
} stc_i2s_sr_bit_t;

typedef struct
{
    __IO uint32_t TXERR;
    __IO uint32_t RXERR;
    uint32_t RESERVED0[30];
} stc_i2s_er_bit_t;

typedef struct
{
    __IO uint32_t I2SSTD0;
    __IO uint32_t I2SSTD1;
    __IO uint32_t DATLEN0;
    __IO uint32_t DATLEN1;
    __IO uint32_t CHLEN;
    __IO uint32_t PCMSYNC;
    uint32_t RESERVED0[26];
} stc_i2s_cfgr_bit_t;

typedef struct
{
    __IO uint32_t SWDTAUTS;
    __IO uint32_t SWDTITS;
    __IO uint32_t SWDTPERI0;
    __IO uint32_t SWDTPERI1;
    __IO uint32_t SWDTCKS0;
    __IO uint32_t SWDTCKS1;
    __IO uint32_t SWDTCKS2;
    __IO uint32_t SWDTCKS3;
    __IO uint32_t SWDTWDPT0;
    __IO uint32_t SWDTWDPT1;
    __IO uint32_t SWDTWDPT2;
    __IO uint32_t SWDTWDPT3;
    __IO uint32_t SWDTSLPOFF;
    uint32_t RESERVED0[3];
    __IO uint32_t WDTAUTS;
    __IO uint32_t WDTITS;
    __IO uint32_t WDTPERI0;
    __IO uint32_t WDTPERI1;
    __IO uint32_t WDTCKS0;
    __IO uint32_t WDTCKS1;
    __IO uint32_t WDTCKS2;
    __IO uint32_t WDTCKS3;
    __IO uint32_t WDTWDPT0;
    __IO uint32_t WDTWDPT1;
    __IO uint32_t WDTWDPT2;
    __IO uint32_t WDTWDPT3;
    __IO uint32_t WDTSLPOFF;
    uint32_t RESERVED1[3];
} stc_icg_icg0_bit_t;

typedef struct
{
    __IO uint32_t HRCFREQSEL;
    uint32_t RESERVED0[7];
    __IO uint32_t HRCSTOP;
    uint32_t RESERVED1[7];
    __IO uint32_t BOR_LEV0;
    __IO uint32_t BOR_LEV1;
    __IO uint32_t BORDIS;
    uint32_t RESERVED2[13];
} stc_icg_icg1_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t SWDTENR;
    __IO uint32_t PVD1ENR;
    __IO uint32_t PVD2ENR;
    __IO uint32_t XTAL32STPENR;
    __IO uint32_t XTALSTPENR;
    uint32_t RESERVED1[2];
    __IO uint32_t REPENR;
    __IO uint32_t RECCENR;
    __IO uint32_t BUSMENR;
    __IO uint32_t WDTENR;
    uint32_t RESERVED2[20];
} stc_intc_nmienr_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t SWDTFR;
    __IO uint32_t PVD1FR;
    __IO uint32_t PVD2FR;
    __IO uint32_t XTAL32STPFR;
    __IO uint32_t XTALSTPFR;
    uint32_t RESERVED1[2];
    __IO uint32_t REPFR;
    __IO uint32_t RECCFR;
    __IO uint32_t BUSMFR;
    __IO uint32_t WDTFR;
    uint32_t RESERVED2[20];
} stc_intc_nmifr_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t SWDTCFR;
    __IO uint32_t PVD1CFR;
    __IO uint32_t PVD2CFR;
    __IO uint32_t XTAL32STPCFR;
    __IO uint32_t XTALSTPCFR;
    uint32_t RESERVED1[2];
    __IO uint32_t REPCFR;
    __IO uint32_t RECCCFR;
    __IO uint32_t BUSMCFR;
    __IO uint32_t WDTCFR;
    uint32_t RESERVED2[20];
} stc_intc_nmicfr_bit_t;

typedef struct
{
    __IO uint32_t EIRQTRG0;
    __IO uint32_t EIRQTRG1;
    uint32_t RESERVED0[2];
    __IO uint32_t EISMPCLK0;
    __IO uint32_t EISMPCLK1;
    uint32_t RESERVED1[1];
    __IO uint32_t EFEN;
    uint32_t RESERVED2[7];
    __IO uint32_t NOCEN;
    uint32_t RESERVED3[16];
} stc_intc_eirqcr_bit_t;

typedef struct
{
    __IO uint32_t EIRQWUEN0;
    __IO uint32_t EIRQWUEN1;
    __IO uint32_t EIRQWUEN2;
    __IO uint32_t EIRQWUEN3;
    __IO uint32_t EIRQWUEN4;
    __IO uint32_t EIRQWUEN5;
    __IO uint32_t EIRQWUEN6;
    __IO uint32_t EIRQWUEN7;
    __IO uint32_t EIRQWUEN8;
    __IO uint32_t EIRQWUEN9;
    __IO uint32_t EIRQWUEN10;
    __IO uint32_t EIRQWUEN11;
    __IO uint32_t EIRQWUEN12;
    __IO uint32_t EIRQWUEN13;
    __IO uint32_t EIRQWUEN14;
    __IO uint32_t EIRQWUEN15;
    __IO uint32_t SWDTWUEN;
    __IO uint32_t PVD1WUEN;
    __IO uint32_t PVD2WUEN;
    __IO uint32_t CMPWUEN;
    __IO uint32_t WKTMWUEN;
    __IO uint32_t RTCALMWUEN;
    __IO uint32_t RTCPRDWUEN;
    __IO uint32_t TMR0GCMWUEN;
    __IO uint32_t TMR2GCMWUEN;
    __IO uint32_t TMR2OVFWUEN;
    __IO uint32_t RXWUEN;
    __IO uint32_t USHWUEN;
    __IO uint32_t USFWUEN;
    __IO uint32_t ETHWUEN;
    uint32_t RESERVED0[2];
} stc_intc_wupen_bit_t;

typedef struct
{
    __IO uint32_t EIFR0;
    __IO uint32_t EIFR1;
    __IO uint32_t EIFR2;
    __IO uint32_t EIFR3;
    __IO uint32_t EIFR4;
    __IO uint32_t EIFR5;
    __IO uint32_t EIFR6;
    __IO uint32_t EIFR7;
    __IO uint32_t EIFR8;
    __IO uint32_t EIFR9;
    __IO uint32_t EIFR10;
    __IO uint32_t EIFR11;
    __IO uint32_t EIFR12;
    __IO uint32_t EIFR13;
    __IO uint32_t EIFR14;
    __IO uint32_t EIFR15;
    uint32_t RESERVED0[16];
} stc_intc_eifr_bit_t;

typedef struct
{
    __IO uint32_t EICFR0;
    __IO uint32_t EICFR1;
    __IO uint32_t EICFR2;
    __IO uint32_t EICFR3;
    __IO uint32_t EICFR4;
    __IO uint32_t EICFR5;
    __IO uint32_t EICFR6;
    __IO uint32_t EICFR7;
    __IO uint32_t EICFR8;
    __IO uint32_t EICFR9;
    __IO uint32_t EICFR10;
    __IO uint32_t EICFR11;
    __IO uint32_t EICFR12;
    __IO uint32_t EICFR13;
    __IO uint32_t EICFR14;
    __IO uint32_t EICFR15;
    uint32_t RESERVED0[16];
} stc_intc_eicfr_bit_t;

typedef struct
{
    __IO uint32_t VSEL0;
    __IO uint32_t VSEL1;
    __IO uint32_t VSEL2;
    __IO uint32_t VSEL3;
    __IO uint32_t VSEL4;
    __IO uint32_t VSEL5;
    __IO uint32_t VSEL6;
    __IO uint32_t VSEL7;
    __IO uint32_t VSEL8;
    __IO uint32_t VSEL9;
    __IO uint32_t VSEL10;
    __IO uint32_t VSEL11;
    __IO uint32_t VSEL12;
    __IO uint32_t VSEL13;
    __IO uint32_t VSEL14;
    __IO uint32_t VSEL15;
    __IO uint32_t VSEL16;
    __IO uint32_t VSEL17;
    __IO uint32_t VSEL18;
    __IO uint32_t VSEL19;
    __IO uint32_t VSEL20;
    __IO uint32_t VSEL21;
    __IO uint32_t VSEL22;
    __IO uint32_t VSEL23;
    __IO uint32_t VSEL24;
    __IO uint32_t VSEL25;
    __IO uint32_t VSEL26;
    __IO uint32_t VSEL27;
    __IO uint32_t VSEL28;
    __IO uint32_t VSEL29;
    __IO uint32_t VSEL30;
    __IO uint32_t VSEL31;
} stc_intc_vssel_bit_t;

typedef struct
{
    __IO uint32_t SWIE0;
    __IO uint32_t SWIE1;
    __IO uint32_t SWIE2;
    __IO uint32_t SWIE3;
    __IO uint32_t SWIE4;
    __IO uint32_t SWIE5;
    __IO uint32_t SWIE6;
    __IO uint32_t SWIE7;
    __IO uint32_t SWIE8;
    __IO uint32_t SWIE9;
    __IO uint32_t SWIE10;
    __IO uint32_t SWIE11;
    __IO uint32_t SWIE12;
    __IO uint32_t SWIE13;
    __IO uint32_t SWIE14;
    __IO uint32_t SWIE15;
    __IO uint32_t SWIE16;
    __IO uint32_t SWIE17;
    __IO uint32_t SWIE18;
    __IO uint32_t SWIE19;
    __IO uint32_t SWIE20;
    __IO uint32_t SWIE21;
    __IO uint32_t SWIE22;
    __IO uint32_t SWIE23;
    __IO uint32_t SWIE24;
    __IO uint32_t SWIE25;
    __IO uint32_t SWIE26;
    __IO uint32_t SWIE27;
    __IO uint32_t SWIE28;
    __IO uint32_t SWIE29;
    __IO uint32_t SWIE30;
    __IO uint32_t SWIE31;
} stc_intc_swier_bit_t;

typedef struct
{
    __IO uint32_t EVTE0;
    __IO uint32_t EVTE1;
    __IO uint32_t EVTE2;
    __IO uint32_t EVTE3;
    __IO uint32_t EVTE4;
    __IO uint32_t EVTE5;
    __IO uint32_t EVTE6;
    __IO uint32_t EVTE7;
    __IO uint32_t EVTE8;
    __IO uint32_t EVTE9;
    __IO uint32_t EVTE10;
    __IO uint32_t EVTE11;
    __IO uint32_t EVTE12;
    __IO uint32_t EVTE13;
    __IO uint32_t EVTE14;
    __IO uint32_t EVTE15;
    __IO uint32_t EVTE16;
    __IO uint32_t EVTE17;
    __IO uint32_t EVTE18;
    __IO uint32_t EVTE19;
    __IO uint32_t EVTE20;
    __IO uint32_t EVTE21;
    __IO uint32_t EVTE22;
    __IO uint32_t EVTE23;
    __IO uint32_t EVTE24;
    __IO uint32_t EVTE25;
    __IO uint32_t EVTE26;
    __IO uint32_t EVTE27;
    __IO uint32_t EVTE28;
    __IO uint32_t EVTE29;
    __IO uint32_t EVTE30;
    __IO uint32_t EVTE31;
} stc_intc_evter_bit_t;

typedef struct
{
    __IO uint32_t IER0;
    __IO uint32_t IER1;
    __IO uint32_t IER2;
    __IO uint32_t IER3;
    __IO uint32_t IER4;
    __IO uint32_t IER5;
    __IO uint32_t IER6;
    __IO uint32_t IER7;
    __IO uint32_t IER8;
    __IO uint32_t IER9;
    __IO uint32_t IER10;
    __IO uint32_t IER11;
    __IO uint32_t IER12;
    __IO uint32_t IER13;
    __IO uint32_t IER14;
    __IO uint32_t IER15;
    __IO uint32_t IER16;
    __IO uint32_t IER17;
    __IO uint32_t IER18;
    __IO uint32_t IER19;
    __IO uint32_t IER20;
    __IO uint32_t IER21;
    __IO uint32_t IER22;
    __IO uint32_t IER23;
    __IO uint32_t IER24;
    __IO uint32_t IER25;
    __IO uint32_t IER26;
    __IO uint32_t IER27;
    __IO uint32_t IER28;
    __IO uint32_t IER29;
    __IO uint32_t IER30;
    __IO uint32_t IER31;
} stc_intc_ier_bit_t;

typedef struct
{
    __IO uint32_t KEYINSEL0;
    __IO uint32_t KEYINSEL1;
    __IO uint32_t KEYINSEL2;
    __IO uint32_t KEYINSEL3;
    __IO uint32_t KEYINSEL4;
    __IO uint32_t KEYINSEL5;
    __IO uint32_t KEYINSEL6;
    __IO uint32_t KEYINSEL7;
    __IO uint32_t KEYINSEL8;
    __IO uint32_t KEYINSEL9;
    __IO uint32_t KEYINSEL10;
    __IO uint32_t KEYINSEL11;
    __IO uint32_t KEYINSEL12;
    __IO uint32_t KEYINSEL13;
    __IO uint32_t KEYINSEL14;
    __IO uint32_t KEYINSEL15;
    uint32_t RESERVED0[4];
    __IO uint32_t CKSEL0;
    __IO uint32_t CKSEL1;
    uint32_t RESERVED1[10];
} stc_keyscan_scr_bit_t;

typedef struct
{
    __IO uint32_t SEN;
    uint32_t RESERVED0[31];
} stc_keyscan_ser_bit_t;

typedef struct
{
    __IO uint32_t START;
    __IO uint32_t INTEN;
    uint32_t RESERVED0[1];
    __IO uint32_t BUSY;
    uint32_t RESERVED1[28];
} stc_mau_csr_bit_t;

typedef struct
{
    __IO uint32_t MPURGSIZE0;
    __IO uint32_t MPURGSIZE1;
    __IO uint32_t MPURGSIZE2;
    __IO uint32_t MPURGSIZE3;
    __IO uint32_t MPURGSIZE4;
    uint32_t RESERVED0[27];
} stc_mpu_rgd_bit_t;

typedef struct
{
    __IO uint32_t SMPU1EAF;
    __IO uint32_t SMPU2EAF;
    __IO uint32_t FMPUEAF;
    __IO uint32_t HMPUEAF;
    __IO uint32_t EMPUEAF;
    uint32_t RESERVED0[27];
} stc_mpu_sr_bit_t;

typedef struct
{
    __IO uint32_t SMPU1ECLR;
    __IO uint32_t SMPU2ECLR;
    __IO uint32_t FMPUECLR;
    __IO uint32_t HMPUECLR;
    __IO uint32_t EMPUECLR;
    uint32_t RESERVED0[27];
} stc_mpu_eclr_bit_t;

typedef struct
{
    __IO uint32_t MPUWE;
    uint32_t RESERVED0[31];
} stc_mpu_wp_bit_t;

typedef struct
{
    __IO uint32_t AESRDP;
    __IO uint32_t AESWRP;
    __IO uint32_t HASHRDP;
    __IO uint32_t HASHWRP;
    __IO uint32_t TRNGRDP;
    __IO uint32_t TRNGWRP;
    __IO uint32_t CRCRDP;
    __IO uint32_t CRCWRP;
    __IO uint32_t FMCRDP;
    __IO uint32_t FMCWRP;
    uint32_t RESERVED0[2];
    __IO uint32_t WDTRDP;
    __IO uint32_t WDTWRP;
    __IO uint32_t SWDTRDP;
    __IO uint32_t SWDTWRP;
    __IO uint32_t BKSRAMRDP;
    __IO uint32_t BKSRAMWRP;
    __IO uint32_t RTCRDP;
    __IO uint32_t RTCWRP;
    __IO uint32_t DMPURDP;
    __IO uint32_t DMPUWRP;
    __IO uint32_t SRAMCRDP;
    __IO uint32_t SRAMCWRP;
    __IO uint32_t INTCRDP;
    __IO uint32_t INTCWRP;
    __IO uint32_t SYSCRDP;
    __IO uint32_t SYSCWRP;
    __IO uint32_t MSTPRDP;
    __IO uint32_t MSPTWRP;
    uint32_t RESERVED1[1];
    __IO uint32_t BUSERRE;
} stc_mpu_ippr_bit_t;

typedef struct
{
    __IO uint32_t S1RG0E;
    __IO uint32_t S1RG1E;
    __IO uint32_t S1RG2E;
    __IO uint32_t S1RG3E;
    __IO uint32_t S1RG4E;
    __IO uint32_t S1RG5E;
    __IO uint32_t S1RG6E;
    __IO uint32_t S1RG7E;
    __IO uint32_t S1RG8E;
    __IO uint32_t S1RG9E;
    __IO uint32_t S1RG10E;
    __IO uint32_t S1RG11E;
    __IO uint32_t S1RG12E;
    __IO uint32_t S1RG13E;
    __IO uint32_t S1RG14E;
    __IO uint32_t S1RG15E;
    uint32_t RESERVED0[16];
} stc_mpu_s1rge_bit_t;

typedef struct
{
    __IO uint32_t S1RG0WP;
    __IO uint32_t S1RG1WP;
    __IO uint32_t S1RG2WP;
    __IO uint32_t S1RG3WP;
    __IO uint32_t S1RG4WP;
    __IO uint32_t S1RG5WP;
    __IO uint32_t S1RG6WP;
    __IO uint32_t S1RG7WP;
    __IO uint32_t S1RG8WP;
    __IO uint32_t S1RG9WP;
    __IO uint32_t S1RG10WP;
    __IO uint32_t S1RG11WP;
    __IO uint32_t S1RG12WP;
    __IO uint32_t S1RG13WP;
    __IO uint32_t S1RG14WP;
    __IO uint32_t S1RG15WP;
    uint32_t RESERVED0[16];
} stc_mpu_s1rgwp_bit_t;

typedef struct
{
    __IO uint32_t S1RG0RP;
    __IO uint32_t S1RG1RP;
    __IO uint32_t S1RG2RP;
    __IO uint32_t S1RG3RP;
    __IO uint32_t S1RG4RP;
    __IO uint32_t S1RG5RP;
    __IO uint32_t S1RG6RP;
    __IO uint32_t S1RG7RP;
    __IO uint32_t S1RG8RP;
    __IO uint32_t S1RG9RP;
    __IO uint32_t S1RG10RP;
    __IO uint32_t S1RG11RP;
    __IO uint32_t S1RG12RP;
    __IO uint32_t S1RG13RP;
    __IO uint32_t S1RG14RP;
    __IO uint32_t S1RG15RP;
    uint32_t RESERVED0[16];
} stc_mpu_s1rgrp_bit_t;

typedef struct
{
    __IO uint32_t SMPU1BRP;
    __IO uint32_t SMPU1BWP;
    __IO uint32_t SMPU1ACT0;
    __IO uint32_t SMPU1ACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t SMPU1E;
    uint32_t RESERVED1[24];
} stc_mpu_s1cr_bit_t;

typedef struct
{
    __IO uint32_t S2RG0E;
    __IO uint32_t S2RG1E;
    __IO uint32_t S2RG2E;
    __IO uint32_t S2RG3E;
    __IO uint32_t S2RG4E;
    __IO uint32_t S2RG5E;
    __IO uint32_t S2RG6E;
    __IO uint32_t S2RG7E;
    __IO uint32_t S2RG8E;
    __IO uint32_t S2RG9E;
    __IO uint32_t S2RG10E;
    __IO uint32_t S2RG11E;
    __IO uint32_t S2RG12E;
    __IO uint32_t S2RG13E;
    __IO uint32_t S2RG14E;
    __IO uint32_t S2RG15E;
    uint32_t RESERVED0[16];
} stc_mpu_s2rge_bit_t;

typedef struct
{
    __IO uint32_t S2RG0WP;
    __IO uint32_t S2RG1WP;
    __IO uint32_t S2RG2WP;
    __IO uint32_t S2RG3WP;
    __IO uint32_t S2RG4WP;
    __IO uint32_t S2RG5WP;
    __IO uint32_t S2RG6WP;
    __IO uint32_t S2RG7WP;
    __IO uint32_t S2RG8WP;
    __IO uint32_t S2RG9WP;
    __IO uint32_t S2RG10WP;
    __IO uint32_t S2RG11WP;
    __IO uint32_t S2RG12WP;
    __IO uint32_t S2RG13WP;
    __IO uint32_t S2RG14WP;
    __IO uint32_t S2RG15WP;
    uint32_t RESERVED0[16];
} stc_mpu_s2rgwp_bit_t;

typedef struct
{
    __IO uint32_t S2RG0RP;
    __IO uint32_t S2RG1RP;
    __IO uint32_t S2RG2RP;
    __IO uint32_t S2RG3RP;
    __IO uint32_t S2RG4RP;
    __IO uint32_t S2RG5RP;
    __IO uint32_t S2RG6RP;
    __IO uint32_t S2RG7RP;
    __IO uint32_t S2RG8RP;
    __IO uint32_t S2RG9RP;
    __IO uint32_t S2RG10RP;
    __IO uint32_t S2RG11RP;
    __IO uint32_t S2RG12RP;
    __IO uint32_t S2RG13RP;
    __IO uint32_t S2RG14RP;
    __IO uint32_t S2RG15RP;
    uint32_t RESERVED0[16];
} stc_mpu_s2rgrp_bit_t;

typedef struct
{
    __IO uint32_t SMPU2BRP;
    __IO uint32_t SMPU2BWP;
    __IO uint32_t SMPU2ACT0;
    __IO uint32_t SMPU2ACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t SMPU2E;
    uint32_t RESERVED1[24];
} stc_mpu_s2cr_bit_t;

typedef struct
{
    __IO uint32_t FRG0E;
    __IO uint32_t FRG1E;
    __IO uint32_t FRG2E;
    __IO uint32_t FRG3E;
    __IO uint32_t FRG4E;
    __IO uint32_t FRG5E;
    __IO uint32_t FRG6E;
    __IO uint32_t FRG7E;
    uint32_t RESERVED0[24];
} stc_mpu_frge_bit_t;

typedef struct
{
    __IO uint32_t FRG0WP;
    __IO uint32_t FRG1WP;
    __IO uint32_t FRG2WP;
    __IO uint32_t FRG3WP;
    __IO uint32_t FRG4WP;
    __IO uint32_t FRG5WP;
    __IO uint32_t FRG6WP;
    __IO uint32_t FRG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_frgwp_bit_t;

typedef struct
{
    __IO uint32_t FRG0RP;
    __IO uint32_t FRG1RP;
    __IO uint32_t FRG2RP;
    __IO uint32_t FRG3RP;
    __IO uint32_t FRG4RP;
    __IO uint32_t FRG5RP;
    __IO uint32_t FRG6RP;
    __IO uint32_t FRG7RP;
    uint32_t RESERVED0[24];
} stc_mpu_frgrp_bit_t;

typedef struct
{
    __IO uint32_t FMPUBRP;
    __IO uint32_t FMPUBWP;
    __IO uint32_t FMPUACT0;
    __IO uint32_t FMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t FMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_fcr_bit_t;

typedef struct
{
    __IO uint32_t HRG0E;
    __IO uint32_t HRG1E;
    __IO uint32_t HRG2E;
    __IO uint32_t HRG3E;
    __IO uint32_t HRG4E;
    __IO uint32_t HRG5E;
    __IO uint32_t HRG6E;
    __IO uint32_t HRG7E;
    uint32_t RESERVED0[24];
} stc_mpu_hrge_bit_t;

typedef struct
{
    __IO uint32_t HRG0WP;
    __IO uint32_t HRG1WP;
    __IO uint32_t HRG2WP;
    __IO uint32_t HRG3WP;
    __IO uint32_t HRG4WP;
    __IO uint32_t HRG5WP;
    __IO uint32_t HRG6WP;
    __IO uint32_t HRG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_hrgwp_bit_t;

typedef struct
{
    __IO uint32_t HRG0RP;
    __IO uint32_t HRG1RP;
    __IO uint32_t HRG2RP;
    __IO uint32_t HRG3RP;
    __IO uint32_t HRG4RP;
    __IO uint32_t HRG5RP;
    __IO uint32_t HRG6RP;
    __IO uint32_t HRG7RP;
    uint32_t RESERVED0[24];
} stc_mpu_hrgrp_bit_t;

typedef struct
{
    __IO uint32_t HMPUBRP;
    __IO uint32_t HMPUBWP;
    __IO uint32_t HMPUACT0;
    __IO uint32_t HMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t HMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_hcr_bit_t;

typedef struct
{
    __IO uint32_t ERG0E;
    __IO uint32_t ERG1E;
    __IO uint32_t ERG2E;
    __IO uint32_t ERG3E;
    __IO uint32_t ERG4E;
    __IO uint32_t ERG5E;
    __IO uint32_t ERG6E;
    __IO uint32_t ERG7E;
    uint32_t RESERVED0[24];
} stc_mpu_erge_bit_t;

typedef struct
{
    __IO uint32_t ERG0WP;
    __IO uint32_t ERG1WP;
    __IO uint32_t ERG2WP;
    __IO uint32_t ERG3WP;
    __IO uint32_t ERG4WP;
    __IO uint32_t ERG5WP;
    __IO uint32_t ERG6WP;
    __IO uint32_t ERG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_ergwp_bit_t;

typedef struct
{
    __IO uint32_t ERG0RP;
    __IO uint32_t ERG1RP;
    __IO uint32_t ERG2RP;
    __IO uint32_t ERG3RP;
    __IO uint32_t ERG4RP;
    __IO uint32_t ERG5RP;
    __IO uint32_t ERG6RP;
    __IO uint32_t ERG7RP;
    uint32_t RESERVED0[24];
} stc_mpu_ergrp_bit_t;

typedef struct
{
    __IO uint32_t EMPUBRP;
    __IO uint32_t EMPUBWP;
    __IO uint32_t EMPUACT0;
    __IO uint32_t EMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t EMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_ecr_bit_t;

typedef struct
{
    __IO uint32_t OTSST;
    __IO uint32_t OTSCK;
    __IO uint32_t OTSIE;
    __IO uint32_t TSSTP;
    uint32_t RESERVED0[12];
} stc_ots_ctl_bit_t;

typedef struct
{
    __IO uint32_t USBFS_DFB;
    __IO uint32_t USBFS_SOFEN;
    uint32_t RESERVED0[6];
    __IO uint32_t USBHS_DFB;
    __IO uint32_t USBHS_SOFEN;
    __IO uint32_t USBHS_FSPHYE;
    uint32_t RESERVED1[5];
    __IO uint32_t USBFS_NFS0;
    __IO uint32_t USBFS_NFS1;
    __IO uint32_t USBFS_NFE;
    uint32_t RESERVED2[5];
    __IO uint32_t USBHS_NFS0;
    __IO uint32_t USBHS_NFS1;
    __IO uint32_t USBHS_NFE;
    uint32_t RESERVED3[5];
} stc_peric_usb_syctlreg_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t SELMMC1;
    uint32_t RESERVED1[1];
    __IO uint32_t SELMMC2;
    uint32_t RESERVED2[28];
} stc_peric_sdioc_syctlreg_bit_t;

typedef struct
{
    __IO uint32_t OPENP;
    uint32_t RESERVED0[31];
} stc_peric_nfc_stcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t NFCEN;
    uint32_t RESERVED1[29];
} stc_peric_nfc_enar_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t SMCEN;
    uint32_t RESERVED1[30];
} stc_peric_smc_enar_bit_t;

typedef struct
{
    __IO uint32_t DMCEN;
    uint32_t RESERVED0[31];
} stc_peric_dmc_enar_bit_t;

typedef struct
{
    __IO uint32_t USASRT1_NFS0;
    __IO uint32_t USASRT1_NFS1;
    __IO uint32_t USART1_NFE;
    uint32_t RESERVED0[29];
} stc_peric_usart1_nfc_bit_t;

typedef struct
{
    __IO uint32_t CHIP_BUSY0;
    __IO uint32_t CHIP_BUSY1;
    __IO uint32_t CHIP_BUSY2;
    __IO uint32_t CHIP_BUSY3;
    __IO uint32_t CHIP_BUSY4;
    __IO uint32_t CHIP_BUSY5;
    __IO uint32_t CHIP_BUSY6;
    __IO uint32_t CHIP_BUSY7;
    __IO uint32_t PECC;
    uint32_t RESERVED0[23];
} stc_peric_nfc_stsr_bit_t;

typedef struct
{
    __IO uint32_t SRAMH;
    uint32_t RESERVED0[3];
    __IO uint32_t SRAM1;
    __IO uint32_t SRAM2;
    __IO uint32_t SRAM3;
    __IO uint32_t SRAM4;
    uint32_t RESERVED1[2];
    __IO uint32_t SRAMB;
    uint32_t RESERVED2[2];
    __IO uint32_t KEY;
    __IO uint32_t DMA1;
    __IO uint32_t DMA2;
    __IO uint32_t FCM;
    __IO uint32_t AOS;
    __IO uint32_t CTC;
    __IO uint32_t CORDIC;
    __IO uint32_t AES;
    __IO uint32_t HASH;
    __IO uint32_t TRNG;
    __IO uint32_t CRC;
    __IO uint32_t DCU1;
    __IO uint32_t DCU2;
    __IO uint32_t DCU3;
    __IO uint32_t DCU4;
    __IO uint32_t DCU5;
    __IO uint32_t DCU6;
    __IO uint32_t DCU7;
    __IO uint32_t DCU8;
} stc_pwc_fcg0_bit_t;

typedef struct
{
    __IO uint32_t CAN1;
    __IO uint32_t CAN2;
    __IO uint32_t ETHER;
    __IO uint32_t QSPI;
    __IO uint32_t I2C1;
    __IO uint32_t I2C2;
    __IO uint32_t I2C3;
    __IO uint32_t I2C4;
    __IO uint32_t I2C5;
    __IO uint32_t I2C6;
    __IO uint32_t SDIOC1;
    __IO uint32_t SDIOC2;
    __IO uint32_t I2S1;
    __IO uint32_t I2S2;
    __IO uint32_t I2S3;
    __IO uint32_t I2S4;
    __IO uint32_t SPI1;
    __IO uint32_t SPI2;
    __IO uint32_t SPI3;
    __IO uint32_t SPI4;
    __IO uint32_t SPI5;
    __IO uint32_t SPI6;
    __IO uint32_t USBFS;
    __IO uint32_t USBHS;
    __IO uint32_t FMAC1;
    __IO uint32_t FMAC2;
    __IO uint32_t FMAC3;
    __IO uint32_t FMAC4;
    uint32_t RESERVED0[4];
} stc_pwc_fcg1_bit_t;

