SoCXin/HC32F4A0/src/hc32f4a0pitb_template/common/hc32f4a0pitb.h
typedef struct
{
    stc_dcu_ctl_bit_t                        CTL_b;
    stc_dcu_flag_bit_t                       FLAG_b;
    uint32_t                                 RESERVED0[96];
    stc_dcu_flagclr_bit_t                    FLAGCLR_b;
    stc_dcu_intevtsel_bit_t                  INTEVTSEL_b;
} bM4_DCU_TypeDef;

typedef struct
{
    stc_dma_en_bit_t                         EN_b;
    stc_dma_intstat0_bit_t                   INTSTAT0_b;
    stc_dma_intstat1_bit_t                   INTSTAT1_b;
    stc_dma_intmask0_bit_t                   INTMASK0_b;
    stc_dma_intmask1_bit_t                   INTMASK1_b;
    stc_dma_intclr0_bit_t                    INTCLR0_b;
    stc_dma_intclr1_bit_t                    INTCLR1_b;
    stc_dma_chen_bit_t                       CHEN_b;
    stc_dma_reqstat_bit_t                    REQSTAT_b;
    stc_dma_chstat_bit_t                     CHSTAT_b;
    uint32_t                                 RESERVED0[32];
    stc_dma_rcfgctl_bit_t                    RCFGCTL_b;
    uint32_t                                 RESERVED1[32];
    stc_dma_chenclr_bit_t                    CHENCLR_b;
    uint32_t                                 RESERVED2[384];
    stc_dma_chctl_bit_t                      CHCTL0_b;
    uint32_t                                 RESERVED3[512];
    stc_dma_chctl_bit_t                      CHCTL1_b;
    uint32_t                                 RESERVED4[512];
    stc_dma_chctl_bit_t                      CHCTL2_b;
    uint32_t                                 RESERVED5[512];
    stc_dma_chctl_bit_t                      CHCTL3_b;
    uint32_t                                 RESERVED6[512];
    stc_dma_chctl_bit_t                      CHCTL4_b;
    uint32_t                                 RESERVED7[512];
    stc_dma_chctl_bit_t                      CHCTL5_b;
    uint32_t                                 RESERVED8[512];
    stc_dma_chctl_bit_t                      CHCTL6_b;
    uint32_t                                 RESERVED9[512];
    stc_dma_chctl_bit_t                      CHCTL7_b;
} bM4_DMA_TypeDef;

typedef struct
{
    stc_dvp_ctr_bit_t                        CTR_b;
    uint32_t                                 RESERVED0[32];
    stc_dvp_str_bit_t                        STR_b;
    stc_dvp_ier_bit_t                        IER_b;
} bM4_DVP_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[160];
    stc_efm_fstp_bit_t                       FSTP_b;
    stc_efm_frmc_bit_t                       FRMC_b;
    stc_efm_fwmc_bit_t                       FWMC_b;
    stc_efm_fsr_bit_t                        FSR_b;
    stc_efm_fsclr_bit_t                      FSCLR_b;
    stc_efm_fite_bit_t                       FITE_b;
    stc_efm_fswp_bit_t                       FSWP_b;
    uint32_t                                 RESERVED1[1696];
    stc_efm_mmf_remcr0_bit_t                 MMF_REMCR0_b;
    stc_efm_mmf_remcr1_bit_t                 MMF_REMCR1_b;
    uint32_t                                 RESERVED2[928];
    stc_efm_wlock_bit_t                      WLOCK_b;
    uint32_t                                 RESERVED3[96];
    stc_efm_f0nwprt0_bit_t                   F0NWPRT0_b;
    stc_efm_f0nwprt1_bit_t                   F0NWPRT1_b;
    stc_efm_f0nwprt2_bit_t                   F0NWPRT2_b;
    stc_efm_f0nwprt3_bit_t                   F0NWPRT3_b;
    stc_efm_f1nwprt0_bit_t                   F1NWPRT0_b;
    stc_efm_f1nwprt1_bit_t                   F1NWPRT1_b;
    stc_efm_f1nwprt2_bit_t                   F1NWPRT2_b;
    stc_efm_f1nwprt3_bit_t                   F1NWPRT3_b;
} bM4_EFM_TypeDef;

typedef struct
{
    stc_emb_ctl1_bit_t                       CTL1_b;
    stc_emb_ctl2_bit_t                       CTL2_b;
    stc_emb_soe_bit_t                        SOE_b;
    stc_emb_stat_bit_t                       STAT_b;
    stc_emb_statclr_bit_t                    STATCLR_b;
    stc_emb_inten_bit_t                      INTEN_b;
    stc_emb_rlssel_bit_t                     RLSSEL_b;
} bM4_EMB_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[172160];
    stc_eth_mac_ifconfr_bit_t                MAC_IFCONFR_b;
    uint32_t                                 RESERVED1[352096];
    stc_eth_mac_configr_bit_t                MAC_CONFIGR_b;
    stc_eth_mac_fltctlr_bit_t                MAC_FLTCTLR_b;
    uint32_t                                 RESERVED2[64];
    stc_eth_mac_smiaddr_bit_t                MAC_SMIADDR_b;
    uint32_t                                 RESERVED3[32];
    stc_eth_mac_floctlr_bit_t                MAC_FLOCTLR_b;
    stc_eth_mac_vtafltr_bit_t                MAC_VTAFLTR_b;
    uint32_t                                 RESERVED4[32];
    stc_eth_mac_macstsr_bit_t                MAC_MACSTSR_b;
    uint32_t                                 RESERVED5[32];
    stc_eth_mac_pmtctlr_bit_t                MAC_PMTCTLR_b;
    uint32_t                                 RESERVED6[64];
    stc_eth_mac_intstsr_bit_t                MAC_INTSTSR_b;
    stc_eth_mac_intmskr_bit_t                MAC_INTMSKR_b;
    stc_eth_mac_macadhr0_bit_t               MAC_MACADHR0_b;
    uint32_t                                 RESERVED7[32];
    stc_eth_mac_macadhr1_bit_t               MAC_MACADHR1_b;
    uint32_t                                 RESERVED8[32];
    stc_eth_mac_macadhr2_bit_t               MAC_MACADHR2_b;
    uint32_t                                 RESERVED9[32];
    stc_eth_mac_macadhr3_bit_t               MAC_MACADHR3_b;
    uint32_t                                 RESERVED10[32];
    stc_eth_mac_macadhr4_bit_t               MAC_MACADHR4_b;
    uint32_t                                 RESERVED11[1248];
    stc_eth_mmc_mmcctlr_bit_t                MMC_MMCCTLR_b;
    stc_eth_mmc_revstsr_bit_t                MMC_REVSTSR_b;
    stc_eth_mmc_trsstsr_bit_t                MMC_TRSSTSR_b;
    stc_eth_mmc_ritctlr_bit_t                MMC_RITCTLR_b;
    stc_eth_mmc_titctlr_bit_t                MMC_TITCTLR_b;
    uint32_t                                 RESERVED12[5984];
    stc_eth_mac_l34ctlr_bit_t                MAC_L34CTLR_b;
    uint32_t                                 RESERVED13[3072];
    stc_eth_mac_vtactlr_bit_t                MAC_VTACTLR_b;
    uint32_t                                 RESERVED14[3008];
    stc_eth_ptp_tspctlr_bit_t                PTP_TSPCTLR_b;
    uint32_t                                 RESERVED15[128];
    stc_eth_ptp_tmunser_bit_t                PTP_TMUNSER_b;
    uint32_t                                 RESERVED16[128];
    stc_eth_ptp_tspstsr_bit_t                PTP_TSPSTSR_b;
    stc_eth_ptp_ppsctlr_bit_t                PTP_PPSCTLR_b;
    uint32_t                                 RESERVED17[18048];
    stc_eth_dma_busmodr_bit_t                DMA_BUSMODR_b;
    uint32_t                                 RESERVED18[128];
    stc_eth_dma_dmastsr_bit_t                DMA_DMASTSR_b;
    stc_eth_dma_oprmodr_bit_t                DMA_OPRMODR_b;
    stc_eth_dma_intenar_bit_t                DMA_INTENAR_b;
    stc_eth_dma_rfrcntr_bit_t                DMA_RFRCNTR_b;
} bM4_ETH_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[96];
    stc_fcm_str_bit_t                        STR_b;
    uint32_t                                 RESERVED1[32];
    stc_fcm_rccr_bit_t                       RCCR_b;
    stc_fcm_rier_bit_t                       RIER_b;
    stc_fcm_sr_bit_t                         SR_b;
    stc_fcm_clr_bit_t                        CLR_b;
} bM4_FCM_TypeDef;

typedef struct
{
    stc_fmac_enr_bit_t                       ENR_b;
    uint32_t                                 RESERVED0[32];
    stc_fmac_ier_bit_t                       IER_b;
    uint32_t                                 RESERVED1[96];
    stc_fmac_str_bit_t                       STR_b;
} bM4_FMAC_TypeDef;

typedef struct
{
    stc_gpio_pidra_bit_t                     PIDRA_b;
    uint32_t                                 RESERVED0[16];
    stc_gpio_podra_bit_t                     PODRA_b;
    stc_gpio_poera_bit_t                     POERA_b;
    stc_gpio_posra_bit_t                     POSRA_b;
    stc_gpio_porra_bit_t                     PORRA_b;
    stc_gpio_potra_bit_t                     POTRA_b;
    uint32_t                                 RESERVED1[16];
    stc_gpio_pidrb_bit_t                     PIDRB_b;
    uint32_t                                 RESERVED2[16];
    stc_gpio_podrb_bit_t                     PODRB_b;
    stc_gpio_poerb_bit_t                     POERB_b;
    stc_gpio_posrb_bit_t                     POSRB_b;
    stc_gpio_porrb_bit_t                     PORRB_b;
    stc_gpio_potrb_bit_t                     POTRB_b;
    uint32_t                                 RESERVED3[16];
    stc_gpio_pidrc_bit_t                     PIDRC_b;
    uint32_t                                 RESERVED4[16];
    stc_gpio_podrc_bit_t                     PODRC_b;
    stc_gpio_poerc_bit_t                     POERC_b;
    stc_gpio_posrc_bit_t                     POSRC_b;
    stc_gpio_porrc_bit_t                     PORRC_b;
    stc_gpio_potrc_bit_t                     POTRC_b;
    uint32_t                                 RESERVED5[16];
    stc_gpio_pidrd_bit_t                     PIDRD_b;
    uint32_t                                 RESERVED6[16];
    stc_gpio_podrd_bit_t                     PODRD_b;
    stc_gpio_poerd_bit_t                     POERD_b;
    stc_gpio_posrd_bit_t                     POSRD_b;
    stc_gpio_porrd_bit_t                     PORRD_b;
    stc_gpio_potrd_bit_t                     POTRD_b;
    uint32_t                                 RESERVED7[16];
    stc_gpio_pidre_bit_t                     PIDRE_b;
    uint32_t                                 RESERVED8[16];
    stc_gpio_podre_bit_t                     PODRE_b;
    stc_gpio_poere_bit_t                     POERE_b;
    stc_gpio_posre_bit_t                     POSRE_b;
    stc_gpio_porre_bit_t                     PORRE_b;
    stc_gpio_potre_bit_t                     POTRE_b;
    uint32_t                                 RESERVED9[272];
    stc_gpio_pidrh_bit_t                     PIDRH_b;
    uint32_t                                 RESERVED10[16];
    stc_gpio_podrh_bit_t                     PODRH_b;
    stc_gpio_poerh_bit_t                     POERH_b;
    stc_gpio_posrh_bit_t                     POSRH_b;
    stc_gpio_porrh_bit_t                     PORRH_b;
    stc_gpio_potrh_bit_t                     POTRH_b;
    uint32_t                                 RESERVED11[16];
    stc_gpio_pidri_bit_t                     PIDRI_b;
    uint32_t                                 RESERVED12[16];
    stc_gpio_podri_bit_t                     PODRI_b;
    stc_gpio_poeri_bit_t                     POERI_b;
    stc_gpio_posri_bit_t                     POSRI_b;
    stc_gpio_porri_bit_t                     PORRI_b;
    stc_gpio_potri_bit_t                     POTRI_b;
    uint32_t                                 RESERVED13[6960];
    stc_gpio_pspcr_bit_t                     PSPCR_b;
    uint32_t                                 RESERVED14[32];
    stc_gpio_pinaer_bit_t                    PINAER_b;
    stc_gpio_pwpr_bit_t                      PWPR_b;
    uint32_t                                 RESERVED15[16];
    stc_gpio_pcr_bit_t                       PCRA0_b;
    stc_gpio_pfsr_bit_t                      PFSRA0_b;
    stc_gpio_pcr_bit_t                       PCRA1_b;
    stc_gpio_pfsr_bit_t                      PFSRA1_b;
    stc_gpio_pcr_bit_t                       PCRA2_b;
    stc_gpio_pfsr_bit_t                      PFSRA2_b;
    stc_gpio_pcr_bit_t                       PCRA3_b;
    stc_gpio_pfsr_bit_t                      PFSRA3_b;
    stc_gpio_pcr_bit_t                       PCRA4_b;
    stc_gpio_pfsr_bit_t                      PFSRA4_b;
    stc_gpio_pcr_bit_t                       PCRA5_b;
    stc_gpio_pfsr_bit_t                      PFSRA5_b;
    stc_gpio_pcr_bit_t                       PCRA6_b;
    stc_gpio_pfsr_bit_t                      PFSRA6_b;
    stc_gpio_pcr_bit_t                       PCRA7_b;
    stc_gpio_pfsr_bit_t                      PFSRA7_b;
    stc_gpio_pcr_bit_t                       PCRA8_b;
    stc_gpio_pfsr_bit_t                      PFSRA8_b;
    stc_gpio_pcr_bit_t                       PCRA9_b;
    stc_gpio_pfsr_bit_t                      PFSRA9_b;
    stc_gpio_pcr_bit_t                       PCRA10_b;
    stc_gpio_pfsr_bit_t                      PFSRA10_b;
    stc_gpio_pcr_bit_t                       PCRA11_b;
    stc_gpio_pfsr_bit_t                      PFSRA11_b;
    stc_gpio_pcr_bit_t                       PCRA12_b;
    stc_gpio_pfsr_bit_t                      PFSRA12_b;
    stc_gpio_pcr_bit_t                       PCRA13_b;
    stc_gpio_pfsr_bit_t                      PFSRA13_b;
    stc_gpio_pcr_bit_t                       PCRA14_b;
    stc_gpio_pfsr_bit_t                      PFSRA14_b;
    stc_gpio_pcr_bit_t                       PCRA15_b;
    stc_gpio_pfsr_bit_t                      PFSRA15_b;
    stc_gpio_pcr_bit_t                       PCRB0_b;
    stc_gpio_pfsr_bit_t                      PFSRB0_b;
    stc_gpio_pcr_bit_t                       PCRB1_b;
    stc_gpio_pfsr_bit_t                      PFSRB1_b;
    stc_gpio_pcr_bit_t                       PCRB2_b;
    stc_gpio_pfsr_bit_t                      PFSRB2_b;
    stc_gpio_pcr_bit_t                       PCRB3_b;
    stc_gpio_pfsr_bit_t                      PFSRB3_b;
    stc_gpio_pcr_bit_t                       PCRB4_b;
    stc_gpio_pfsr_bit_t                      PFSRB4_b;
    stc_gpio_pcr_bit_t                       PCRB5_b;
    stc_gpio_pfsr_bit_t                      PFSRB5_b;
    stc_gpio_pcr_bit_t                       PCRB6_b;
    stc_gpio_pfsr_bit_t                      PFSRB6_b;
    stc_gpio_pcr_bit_t                       PCRB7_b;
    stc_gpio_pfsr_bit_t                      PFSRB7_b;
    stc_gpio_pcr_bit_t                       PCRB8_b;
    stc_gpio_pfsr_bit_t                      PFSRB8_b;
    stc_gpio_pcr_bit_t                       PCRB9_b;
    stc_gpio_pfsr_bit_t                      PFSRB9_b;
    stc_gpio_pcr_bit_t                       PCRB10_b;
    stc_gpio_pfsr_bit_t                      PFSRB10_b;
    stc_gpio_pcr_bit_t                       PCRB11_b;
    stc_gpio_pfsr_bit_t                      PFSRB11_b;
    stc_gpio_pcr_bit_t                       PCRB12_b;
    stc_gpio_pfsr_bit_t                      PFSRB12_b;
    stc_gpio_pcr_bit_t                       PCRB13_b;
    stc_gpio_pfsr_bit_t                      PFSRB13_b;
    stc_gpio_pcr_bit_t                       PCRB14_b;
    stc_gpio_pfsr_bit_t                      PFSRB14_b;
    stc_gpio_pcr_bit_t                       PCRB15_b;
    stc_gpio_pfsr_bit_t                      PFSRB15_b;
    stc_gpio_pcr_bit_t                       PCRC0_b;
    stc_gpio_pfsr_bit_t                      PFSRC0_b;
    stc_gpio_pcr_bit_t                       PCRC1_b;
    stc_gpio_pfsr_bit_t                      PFSRC1_b;
    stc_gpio_pcr_bit_t                       PCRC2_b;
    stc_gpio_pfsr_bit_t                      PFSRC2_b;
    stc_gpio_pcr_bit_t                       PCRC3_b;
    stc_gpio_pfsr_bit_t                      PFSRC3_b;
    stc_gpio_pcr_bit_t                       PCRC4_b;
    stc_gpio_pfsr_bit_t                      PFSRC4_b;
    stc_gpio_pcr_bit_t                       PCRC5_b;
    stc_gpio_pfsr_bit_t                      PFSRC5_b;
    stc_gpio_pcr_bit_t                       PCRC6_b;
    stc_gpio_pfsr_bit_t                      PFSRC6_b;
    stc_gpio_pcr_bit_t                       PCRC7_b;
    stc_gpio_pfsr_bit_t                      PFSRC7_b;
    stc_gpio_pcr_bit_t                       PCRC8_b;
    stc_gpio_pfsr_bit_t                      PFSRC8_b;
    stc_gpio_pcr_bit_t                       PCRC9_b;
    stc_gpio_pfsr_bit_t                      PFSRC9_b;
    stc_gpio_pcr_bit_t                       PCRC10_b;
    stc_gpio_pfsr_bit_t                      PFSRC10_b;
    stc_gpio_pcr_bit_t                       PCRC11_b;
    stc_gpio_pfsr_bit_t                      PFSRC11_b;
    stc_gpio_pcr_bit_t                       PCRC12_b;
    stc_gpio_pfsr_bit_t                      PFSRC12_b;
    stc_gpio_pcr_bit_t                       PCRC13_b;
    stc_gpio_pfsr_bit_t                      PFSRC13_b;
    stc_gpio_pcr_bit_t                       PCRC14_b;
    stc_gpio_pfsr_bit_t                      PFSRC14_b;
    stc_gpio_pcr_bit_t                       PCRC15_b;
    stc_gpio_pfsr_bit_t                      PFSRC15_b;
    stc_gpio_pcr_bit_t                       PCRD0_b;
    stc_gpio_pfsr_bit_t                      PFSRD0_b;
    stc_gpio_pcr_bit_t                       PCRD1_b;
    stc_gpio_pfsr_bit_t                      PFSRD1_b;
    stc_gpio_pcr_bit_t                       PCRD2_b;
    stc_gpio_pfsr_bit_t                      PFSRD2_b;
    stc_gpio_pcr_bit_t                       PCRD3_b;
    stc_gpio_pfsr_bit_t                      PFSRD3_b;
    stc_gpio_pcr_bit_t                       PCRD4_b;
    stc_gpio_pfsr_bit_t                      PFSRD4_b;
    stc_gpio_pcr_bit_t                       PCRD5_b;
    stc_gpio_pfsr_bit_t                      PFSRD5_b;
    stc_gpio_pcr_bit_t                       PCRD6_b;
    stc_gpio_pfsr_bit_t                      PFSRD6_b;
    stc_gpio_pcr_bit_t                       PCRD7_b;
    stc_gpio_pfsr_bit_t                      PFSRD7_b;
    stc_gpio_pcr_bit_t                       PCRD8_b;
    stc_gpio_pfsr_bit_t                      PFSRD8_b;
    stc_gpio_pcr_bit_t                       PCRD9_b;
    stc_gpio_pfsr_bit_t                      PFSRD9_b;
    stc_gpio_pcr_bit_t                       PCRD10_b;
    stc_gpio_pfsr_bit_t                      PFSRD10_b;
    stc_gpio_pcr_bit_t                       PCRD11_b;
    stc_gpio_pfsr_bit_t                      PFSRD11_b;
    stc_gpio_pcr_bit_t                       PCRD12_b;
    stc_gpio_pfsr_bit_t                      PFSRD12_b;
    stc_gpio_pcr_bit_t                       PCRD13_b;
    stc_gpio_pfsr_bit_t                      PFSRD13_b;
    stc_gpio_pcr_bit_t                       PCRD14_b;
    stc_gpio_pfsr_bit_t                      PFSRD14_b;
    stc_gpio_pcr_bit_t                       PCRD15_b;
    stc_gpio_pfsr_bit_t                      PFSRD15_b;
    stc_gpio_pcr_bit_t                       PCRE0_b;
    stc_gpio_pfsr_bit_t                      PFSRE0_b;
    stc_gpio_pcr_bit_t                       PCRE1_b;
    stc_gpio_pfsr_bit_t                      PFSRE1_b;
    stc_gpio_pcr_bit_t                       PCRE2_b;
    stc_gpio_pfsr_bit_t                      PFSRE2_b;
    stc_gpio_pcr_bit_t                       PCRE3_b;
    stc_gpio_pfsr_bit_t                      PFSRE3_b;
    stc_gpio_pcr_bit_t                       PCRE4_b;
    stc_gpio_pfsr_bit_t                      PFSRE4_b;
    stc_gpio_pcr_bit_t                       PCRE5_b;
    stc_gpio_pfsr_bit_t                      PFSRE5_b;
    stc_gpio_pcr_bit_t                       PCRE6_b;
    stc_gpio_pfsr_bit_t                      PFSRE6_b;
    stc_gpio_pcr_bit_t                       PCRE7_b;
    stc_gpio_pfsr_bit_t                      PFSRE7_b;
    stc_gpio_pcr_bit_t                       PCRE8_b;
    stc_gpio_pfsr_bit_t                      PFSRE8_b;
    stc_gpio_pcr_bit_t                       PCRE9_b;
    stc_gpio_pfsr_bit_t                      PFSRE9_b;
    stc_gpio_pcr_bit_t                       PCRE10_b;
    stc_gpio_pfsr_bit_t                      PFSRE10_b;
    stc_gpio_pcr_bit_t                       PCRE11_b;
    stc_gpio_pfsr_bit_t                      PFSRE11_b;
    stc_gpio_pcr_bit_t                       PCRE12_b;
    stc_gpio_pfsr_bit_t                      PFSRE12_b;
    stc_gpio_pcr_bit_t                       PCRE13_b;
    stc_gpio_pfsr_bit_t                      PFSRE13_b;
    stc_gpio_pcr_bit_t                       PCRE14_b;
    stc_gpio_pfsr_bit_t                      PFSRE14_b;
    stc_gpio_pcr_bit_t                       PCRE15_b;
    stc_gpio_pfsr_bit_t                      PFSRE15_b;
    uint32_t                                 RESERVED16[1024];
    stc_gpio_pcr_bit_t                       PCRH0_b;
    stc_gpio_pfsr_bit_t                      PFSRH0_b;
    stc_gpio_pcr_bit_t                       PCRH1_b;
    stc_gpio_pfsr_bit_t                      PFSRH1_b;
    uint32_t                                 RESERVED17[864];
    stc_gpio_pcr_bit_t                       PCRI13_b;
    stc_gpio_pfsr_bit_t                      PFSRI13_b;
} bM4_GPIO_TypeDef;

typedef struct
{
    stc_hash_cr_bit_t                        CR_b;
} bM4_HASH_TypeDef;

typedef struct
{
    stc_hrpwm_cr_bit_t                       CR1_b;
    stc_hrpwm_cr_bit_t                       CR2_b;
    stc_hrpwm_cr_bit_t                       CR3_b;
    stc_hrpwm_cr_bit_t                       CR4_b;
    stc_hrpwm_cr_bit_t                       CR5_b;
    stc_hrpwm_cr_bit_t                       CR6_b;
    stc_hrpwm_cr_bit_t                       CR7_b;
    stc_hrpwm_cr_bit_t                       CR8_b;
    stc_hrpwm_cr_bit_t                       CR9_b;
    stc_hrpwm_cr_bit_t                       CR10_b;
    stc_hrpwm_cr_bit_t                       CR11_b;
    stc_hrpwm_cr_bit_t                       CR12_b;
    stc_hrpwm_cr_bit_t                       CR13_b;
    stc_hrpwm_cr_bit_t                       CR14_b;
    stc_hrpwm_cr_bit_t                       CR15_b;
    stc_hrpwm_cr_bit_t                       CR16_b;
    uint32_t                                 RESERVED0[128];
    stc_hrpwm_calcr_bit_t                    CALCR0_b;
    stc_hrpwm_calcr_bit_t                    CALCR1_b;
} bM4_HRPWM_TypeDef;

typedef struct
{
    stc_i2c_cr1_bit_t                        CR1_b;
    stc_i2c_cr2_bit_t                        CR2_b;
    stc_i2c_cr3_bit_t                        CR3_b;
    stc_i2c_cr4_bit_t                        CR4_b;
    stc_i2c_slr0_bit_t                       SLR0_b;
    stc_i2c_slr1_bit_t                       SLR1_b;
    uint32_t                                 RESERVED0[32];
    stc_i2c_sr_bit_t                         SR_b;
    stc_i2c_clr_bit_t                        CLR_b;
    uint32_t                                 RESERVED1[96];
    stc_i2c_fltr_bit_t                       FLTR_b;
} bM4_I2C_TypeDef;

typedef struct
{
    stc_i2s_ctrl_bit_t                       CTRL_b;
    stc_i2s_sr_bit_t                         SR_b;
    stc_i2s_er_bit_t                         ER_b;
    stc_i2s_cfgr_bit_t                       CFGR_b;
} bM4_I2S_TypeDef;

typedef struct
{
    stc_icg_icg0_bit_t                       ICG0_b;
    stc_icg_icg1_bit_t                       ICG1_b;
} bM4_ICG_TypeDef;

