SoCXin/HC32F4A0/src/hc32f4a0pitb_template/common/hc32f4a0pitb.h
#define bM4_ADC1                             ((bM4_ADC_TypeDef *)0x42800000UL)
#define bM4_ADC2                             ((bM4_ADC_TypeDef *)0x42808000UL)
#define bM4_ADC3                             ((bM4_ADC_TypeDef *)0x42810000UL)
#define bM4_AES                              ((bM4_AES_TypeDef *)0x42100000UL)
#define bM4_AOS                              ((bM4_AOS_TypeDef *)0x42210000UL)
#define bM4_CAN1                             ((bM4_CAN_TypeDef *)0x42120000UL)
#define bM4_CAN2                             ((bM4_CAN_TypeDef *)0x42F00000UL)
#define bM4_CMP1                             ((bM4_CMP_TypeDef *)0x42940000UL)
#define bM4_CMP2                             ((bM4_CMP_TypeDef *)0x42940200UL)
#define bM4_CMP3                             ((bM4_CMP_TypeDef *)0x42948000UL)
#define bM4_CMP4                             ((bM4_CMP_TypeDef *)0x42948200UL)
#define bM4_CMU                              ((bM4_CMU_TypeDef *)0x42988000UL)
#define bM4_CRC                              ((bM4_CRC_TypeDef *)0x42118000UL)
#define bM4_CTC                              ((bM4_CTC_TypeDef *)0x42938000UL)
#define bM4_DAC1                             ((bM4_DAC_TypeDef *)0x42820000UL)
#define bM4_DAC2                             ((bM4_DAC_TypeDef *)0x42828000UL)
#define bM4_DCU1                             ((bM4_DCU_TypeDef *)0x42AC0000UL)
#define bM4_DCU2                             ((bM4_DCU_TypeDef *)0x42AC8000UL)
#define bM4_DCU3                             ((bM4_DCU_TypeDef *)0x42AD0000UL)
#define bM4_DCU4                             ((bM4_DCU_TypeDef *)0x42AD8000UL)
#define bM4_DCU5                             ((bM4_DCU_TypeDef *)0x42AE0000UL)
#define bM4_DCU6                             ((bM4_DCU_TypeDef *)0x42AE8000UL)
#define bM4_DCU7                             ((bM4_DCU_TypeDef *)0x42AF0000UL)
#define bM4_DCU8                             ((bM4_DCU_TypeDef *)0x42AF8000UL)
#define bM4_DMA1                             ((bM4_DMA_TypeDef *)0x42A60000UL)
#define bM4_DMA2                             ((bM4_DMA_TypeDef *)0x42A68000UL)
#define bM4_DVP                              ((bM4_DVP_TypeDef *)0x42AB0000UL)
#define bM4_EFM                              ((bM4_EFM_TypeDef *)0x42208000UL)
#define bM4_EMB0                             ((bM4_EMB_TypeDef *)0x422F8000UL)
#define bM4_EMB1                             ((bM4_EMB_TypeDef *)0x422F8400UL)
#define bM4_EMB2                             ((bM4_EMB_TypeDef *)0x422F8800UL)
#define bM4_EMB3                             ((bM4_EMB_TypeDef *)0x422F8C00UL)
#define bM4_EMB4                             ((bM4_EMB_TypeDef *)0x422F9000UL)
#define bM4_EMB5                             ((bM4_EMB_TypeDef *)0x422F9400UL)
#define bM4_EMB6                             ((bM4_EMB_TypeDef *)0x422F9800UL)
#define bM4_ETH                              ((bM4_ETH_TypeDef *)0x42A00000UL)
#define bM4_FCM                              ((bM4_FCM_TypeDef *)0x42908000UL)
#define bM4_FMAC1                            ((bM4_FMAC_TypeDef *)0x42B00000UL)
#define bM4_FMAC2                            ((bM4_FMAC_TypeDef *)0x42B08000UL)
#define bM4_FMAC3                            ((bM4_FMAC_TypeDef *)0x42B10000UL)
#define bM4_FMAC4                            ((bM4_FMAC_TypeDef *)0x42B18000UL)
#define bM4_GPIO                             ((bM4_GPIO_TypeDef *)0x42A70000UL)
#define bM4_HASH                             ((bM4_HASH_TypeDef *)0x42108000UL)
#define bM4_HRPWM                            ((bM4_HRPWM_TypeDef *)0x42780000UL)
#define bM4_I2C1                             ((bM4_I2C_TypeDef *)0x429C0000UL)
#define bM4_I2C2                             ((bM4_I2C_TypeDef *)0x429C8000UL)
#define bM4_I2C3                             ((bM4_I2C_TypeDef *)0x429D0000UL)
#define bM4_I2C4                             ((bM4_I2C_TypeDef *)0x429D8000UL)
#define bM4_I2C5                             ((bM4_I2C_TypeDef *)0x429E0000UL)
#define bM4_I2C6                             ((bM4_I2C_TypeDef *)0x429F0000UL)
#define bM4_I2S1                             ((bM4_I2S_TypeDef *)0x423C0000UL)
#define bM4_I2S2                             ((bM4_I2S_TypeDef *)0x423C8000UL)
#define bM4_I2S3                             ((bM4_I2S_TypeDef *)0x42440000UL)
#define bM4_I2S4                             ((bM4_I2S_TypeDef *)0x42448000UL)
#define bM4_INTC                             ((bM4_INTC_TypeDef *)0x42A20000UL)
#define bM4_KEYSCAN                          ((bM4_KEYSCAN_TypeDef *)0x42A18000UL)
#define bM4_MAU                              ((bM4_MAU_TypeDef *)0x42AA0000UL)
#define bM4_MPU                              ((bM4_MPU_TypeDef *)0x42A00000UL)
#define bM4_OTS                              ((bM4_OTS_TypeDef *)0x4220C000UL)
#define bM4_PERIC                            ((bM4_PERIC_TypeDef *)0x42AA8000UL)
#define bM4_PWC                              ((bM4_PWC_TypeDef *)0x42900000UL)
#define bM4_RMU                              ((bM4_RMU_TypeDef *)0x42998000UL)
#define bM4_RTC                              ((bM4_RTC_TypeDef *)0x42980000UL)
#define bM4_SDIOC1                           ((bM4_SDIOC_TypeDef *)0x42E00000UL)
#define bM4_SDIOC2                           ((bM4_SDIOC_TypeDef *)0x42F08000UL)
#define bM4_SPI1                             ((bM4_SPI_TypeDef *)0x42380000UL)
#define bM4_SPI2                             ((bM4_SPI_TypeDef *)0x42388000UL)
#define bM4_SPI3                             ((bM4_SPI_TypeDef *)0x42390000UL)
#define bM4_SPI4                             ((bM4_SPI_TypeDef *)0x42400000UL)
#define bM4_SPI5                             ((bM4_SPI_TypeDef *)0x42408000UL)
#define bM4_SPI6                             ((bM4_SPI_TypeDef *)0x42410000UL)
#define bM4_SRAMC                            ((bM4_SRAMC_TypeDef *)0x42A10000UL)
#define bM4_SWDT                             ((bM4_SWDT_TypeDef *)0x42928000UL)
#define bM4_TMR0_1                           ((bM4_TMR0_TypeDef *)0x42480000UL)
#define bM4_TMR0_2                           ((bM4_TMR0_TypeDef *)0x42488000UL)
#define bM4_TMR2_1                           ((bM4_TMR2_TypeDef *)0x42490000UL)
#define bM4_TMR2_2                           ((bM4_TMR2_TypeDef *)0x42498000UL)
#define bM4_TMR2_3                           ((bM4_TMR2_TypeDef *)0x424A0000UL)
#define bM4_TMR2_4                           ((bM4_TMR2_TypeDef *)0x424A8000UL)
#define bM4_TMR4_1                           ((bM4_TMR4_TypeDef *)0x42700000UL)
#define bM4_TMR4_2                           ((bM4_TMR4_TypeDef *)0x42708000UL)
#define bM4_TMR4_3                           ((bM4_TMR4_TypeDef *)0x42710000UL)
#define bM4_TMR6_1                           ((bM4_TMR6_TypeDef *)0x42300000UL)
#define bM4_TMR6_2                           ((bM4_TMR6_TypeDef *)0x42308000UL)
#define bM4_TMR6_3                           ((bM4_TMR6_TypeDef *)0x42310000UL)
#define bM4_TMR6_4                           ((bM4_TMR6_TypeDef *)0x42318000UL)
#define bM4_TMR6_5                           ((bM4_TMR6_TypeDef *)0x42320000UL)
#define bM4_TMR6_6                           ((bM4_TMR6_TypeDef *)0x42328000UL)
#define bM4_TMR6_7                           ((bM4_TMR6_TypeDef *)0x42330000UL)
#define bM4_TMR6_8                           ((bM4_TMR6_TypeDef *)0x42338000UL)
#define bM4_TMRA_1                           ((bM4_TMRA_TypeDef *)0x42740000UL)
#define bM4_TMRA_10                          ((bM4_TMRA_TypeDef *)0x424E8000UL)
#define bM4_TMRA_11                          ((bM4_TMRA_TypeDef *)0x424F0000UL)
#define bM4_TMRA_12                          ((bM4_TMRA_TypeDef *)0x424F8000UL)
#define bM4_TMRA_2                           ((bM4_TMRA_TypeDef *)0x42748000UL)
#define bM4_TMRA_3                           ((bM4_TMRA_TypeDef *)0x42750000UL)
#define bM4_TMRA_4                           ((bM4_TMRA_TypeDef *)0x42758000UL)
#define bM4_TMRA_5                           ((bM4_TMRA_TypeDef *)0x424C0000UL)
#define bM4_TMRA_6                           ((bM4_TMRA_TypeDef *)0x424C8000UL)
#define bM4_TMRA_7                           ((bM4_TMRA_TypeDef *)0x424D0000UL)
#define bM4_TMRA_8                           ((bM4_TMRA_TypeDef *)0x424D8000UL)
#define bM4_TMRA_9                           ((bM4_TMRA_TypeDef *)0x424E0000UL)
#define bM4_TRNG                             ((bM4_TRNG_TypeDef *)0x42840000UL)
#define bM4_USART1                           ((bM4_USART_TypeDef *)0x42398000UL)
#define bM4_USART10                          ((bM4_USART_TypeDef *)0x42438000UL)
#define bM4_USART2                           ((bM4_USART_TypeDef *)0x423A0000UL)
#define bM4_USART3                           ((bM4_USART_TypeDef *)0x423A8000UL)
#define bM4_USART4                           ((bM4_USART_TypeDef *)0x423B0000UL)
#define bM4_USART5                           ((bM4_USART_TypeDef *)0x423B8000UL)
#define bM4_USART6                           ((bM4_USART_TypeDef *)0x42418000UL)
#define bM4_USART7                           ((bM4_USART_TypeDef *)0x42420000UL)
#define bM4_USART8                           ((bM4_USART_TypeDef *)0x42428000UL)
#define bM4_USART9                           ((bM4_USART_TypeDef *)0x42430000UL)
#define bM4_USBFS                            ((bM4_USBFS_TypeDef *)0x43000000UL)
#define bM4_USBHS                            ((bM4_USBHS_TypeDef *)0x43800000UL)
#define bM4_WDT                              ((bM4_WDT_TypeDef *)0x42920000UL)



#ifdef __cplusplus
}
#endif

#endif /* __HC32F4A0PITB_H__ */

